"{\"class_name\": \"Tokenizer\", \"config\": {\"num_words\": 292, \"filters\": \"!\\\"#$%&()*+,-./:;<=>?@[\\\\]^_`{|}~\\t\\n\", \"lower\": true, \"split\": \" \", \"char_level\": false, \"oov_token\": \"UNK\", \"document_count\": 449, \"word_counts\": \"{\\\"hi\\\": 1, \\\"how\\\": 51, \\\"are\\\": 14, \\\"you\\\": 3, \\\"is\\\": 163, \\\"anyone\\\": 1, \\\"there\\\": 2, \\\"hello\\\": 1, \\\"good\\\": 2, \\\"day\\\": 2, \\\"what\\\\u00e2\\\\u20ac\\\\u2122s\\\": 1, \\\"up\\\": 1, \\\"what\\\": 177, \\\"a\\\": 94, \\\"protected\\\": 5, \\\"member\\\": 4, \\\"does\\\": 24, \\\"being\\\": 3, \\\"of\\\": 28, \\\"class\\\": 20, \\\"mean\\\": 3, \\\"entail\\\": 1, \\\"function\\\": 30, \\\"define\\\": 105, \\\"members\\\": 1, \\\"the\\\": 32, \\\"this\\\": 4, \\\"pointer\\\": 4, \\\"do\\\": 16, \\\"an\\\": 36, \\\"overflow\\\": 8, \\\"error\\\": 26, \\\"errors\\\": 1, \\\"cya\\\": 1, \\\"see\\\": 1, \\\"later\\\": 1, \\\"goodbye\\\": 1, \\\"i\\\": 1, \\\"am\\\": 1, \\\"leaving\\\": 1, \\\"have\\\": 1, \\\"c\\\": 9, \\\"compiler\\\": 4, \\\"visual\\\": 1, \\\"studio\\\": 1, \\\"polymorphism\\\": 3, \\\"classes\\\": 9, \\\"in\\\": 23, \\\"functions\\\": 4, \\\"inheritance\\\": 8, \\\"use\\\": 2, \\\"describe\\\": 44, \\\"header\\\": 6, \\\"file\\\": 12, \\\"h\\\": 1, \\\"files\\\": 1, \\\"data\\\": 13, \\\"types\\\": 3, \\\"many\\\": 2, \\\"stored\\\": 2, \\\"top\\\": 2, \\\"down\\\": 2, \\\"design\\\": 2, \\\"explain\\\": 8, \\\"stepwise\\\": 1, \\\"refinement\\\": 1, \\\"meant\\\": 7, \\\"by\\\": 9, \\\"flow\\\": 3, \\\"chart\\\": 4, \\\"purpose\\\": 4, \\\"flowchart\\\": 2, \\\"pseudocode\\\": 3, \\\"sequence\\\": 4, \\\"structure\\\": 14, \\\"programming\\\": 2, \\\"conditional\\\": 4, \\\"selection\\\": 5, \\\"loop\\\": 22, \\\"repetition\\\": 1, \\\"iteration\\\": 1, \\\"relational\\\": 2, \\\"operator\\\": 17, \\\"operators\\\": 1, \\\"to\\\": 28, \\\"declare\\\": 2, \\\"array\\\": 42, \\\"initialize\\\": 1, \\\"method\\\": 4, \\\"for\\\": 10, \\\"me\\\": 1, \\\"declaration\\\": 5, \\\"one\\\": 3, \\\"dimensional\\\": 1, \\\"elements\\\": 5, \\\"made\\\": 1, \\\"offsets\\\": 2, \\\"offset\\\": 3, \\\"arrays\\\": 2, \\\"size\\\": 9, \\\"we\\\": 8, \\\"constant\\\": 4, \\\"maximum\\\": 1, \\\"can\\\": 7, \\\"be\\\": 1, \\\"sorting\\\": 4, \\\"algorithm\\\": 2, \\\"sort\\\": 7, \\\"vector\\\": 1, \\\"find\\\": 4, \\\"ascending\\\": 1, \\\"descending\\\": 1, \\\"search\\\": 7, \\\"algorithms\\\": 1, \\\"value\\\": 6, \\\"element\\\": 2, \\\"sequential\\\": 2, \\\"binary\\\": 1, \\\"ordered\\\": 1, \\\"faster\\\": 1, \\\"cstyle\\\": 7, \\\"string\\\": 17, \\\"char\\\": 4, \\\"character\\\": 8, \\\"difference\\\": 3, \\\"between\\\": 4, \\\"and\\\": 8, \\\"normal\\\": 3, \\\"differentiate\\\": 1, \\\"assign\\\": 1, \\\"more\\\": 1, \\\"than\\\": 1, \\\"exceed\\\": 2, \\\"cstring\\\": 2, \\\"list\\\": 4, \\\"library\\\": 5, \\\"strlen\\\": 2, \\\"length\\\": 2, \\\"return\\\": 4, \\\"strcpy\\\": 4, \\\"copy\\\": 2, \\\"strings\\\": 2, \\\"another\\\": 2, \\\"strcat\\\": 5, \\\"join\\\": 1, \\\"concatenate\\\": 1, \\\"strcmp\\\": 4, \\\"compare\\\": 2, \\\"ascii\\\": 1, \\\"values\\\": 1, \\\"type\\\": 4, \\\"add\\\": 2, \\\"get\\\": 2, \\\"empty\\\": 4, \\\"know\\\": 1, \\\"if\\\": 8, \\\"or\\\": 4, \\\"not\\\": 4, \\\"substr\\\": 2, \\\"edit\\\": 1, \\\"specific\\\": 1, \\\"part\\\": 1, \\\"cstr\\\": 3, \\\"filename\\\": 1, \\\"logical\\\": 5, \\\"operation\\\": 1, \\\"logic\\\": 3, \\\"behind\\\": 3, \\\"true\\\": 3, \\\"truth\\\": 3, \\\"table\\\": 3, \\\"short\\\": 7, \\\"circuiting\\\": 4, \\\"statement\\\": 15, \\\"stand\\\": 1, \\\"alone\\\": 1, \\\"work\\\": 11, \\\"else\\\": 2, \\\"nested\\\": 2, \\\"why\\\": 4, \\\"used\\\": 4, \\\"switch\\\": 3, \\\"fuction\\\": 1, \\\"break\\\": 5, \\\"inside\\\": 1, \\\"case\\\": 1, \\\"overloading\\\": 3, \\\"controlling\\\": 2, \\\"expression\\\": 4, \\\"test\\\": 3, \\\"comment\\\": 6, \\\"write\\\": 1, \\\"application\\\": 1, \\\"preprocessor\\\": 3, \\\"directive\\\": 6, \\\"include\\\": 3, \\\"iostream\\\": 3, \\\"cmath\\\": 3, \\\"namespace\\\": 3, \\\"using\\\": 3, \\\"code\\\": 3, \\\"block\\\": 3, \\\"main\\\": 3, \\\"variable\\\": 3, \\\"memory\\\": 3, \\\"snapshot\\\": 3, \\\"int\\\": 3, \\\"long\\\": 6, \\\"float\\\": 3, \\\"double\\\": 6, \\\"bool\\\": 3, \\\"boolean\\\": 3, \\\"implementation\\\": 3, \\\"truncated\\\": 3, \\\"result\\\": 3, \\\"underflow\\\": 3, \\\"undeflow\\\": 1, \\\"cin\\\": 3, \\\"cout\\\": 3, \\\"syntax\\\": 6, \\\"parse\\\": 3, \\\"execution\\\": 3, \\\"runtime\\\": 3, \\\"while\\\": 10, \\\"modification\\\": 2, \\\"loops\\\": 5, \\\"update\\\": 1, \\\"command\\\": 2, \\\"continue\\\": 3, \\\"counter\\\": 2, \\\"controlled\\\": 6, \\\"sentinel\\\": 2, \\\"end\\\": 2, \\\"kind\\\": 1, \\\"infinite\\\": 2, \\\"terminate\\\": 1, \\\"modularity\\\": 6, \\\"modules\\\": 3, \\\"required\\\": 1, \\\"needed\\\": 1, \\\"abstraction\\\": 3, \\\"advantages\\\": 2, \\\"charts\\\": 2, \\\"drivers\\\": 1, \\\"driver\\\": 2, \\\"definition\\\": 2, \\\"parameter\\\": 6, \\\"body\\\": 2, \\\"prototype\\\": 3, \\\"scope\\\": 4, \\\"custom\\\": 3, \\\"fine\\\": 1, \\\"formal\\\": 2, \\\"parameters\\\": 2, \\\"actual\\\": 3, \\\"pass\\\": 2, \\\"storage\\\": 8, \\\"automatic\\\": 1, \\\"auto\\\": 1, \\\"static\\\": 3, \\\"random\\\": 3, \\\"number\\\": 3, \\\"seed\\\": 3, \\\"mutator\\\": 3, \\\"methods\\\": 3, \\\"standard\\\": 3, \\\"stream\\\": 3, \\\"multiple\\\": 3, \\\"endoffile\\\": 3, \\\"trailer\\\": 3, \\\"signal\\\": 3, \\\"state\\\": 6, \\\"whitespace\\\": 3, \\\"flags\\\": 3, \\\"summation\\\": 3, \\\"notation\\\": 3}\", \"word_docs\": \"{\\\"hi\\\": 1, \\\"are\\\": 14, \\\"how\\\": 51, \\\"you\\\": 3, \\\"is\\\": 163, \\\"anyone\\\": 1, \\\"there\\\": 2, \\\"hello\\\": 1, \\\"day\\\": 2, \\\"good\\\": 2, \\\"up\\\": 1, \\\"what\\\\u00e2\\\\u20ac\\\\u2122s\\\": 1, \\\"what\\\": 176, \\\"a\\\": 90, \\\"protected\\\": 5, \\\"member\\\": 4, \\\"of\\\": 28, \\\"class\\\": 20, \\\"mean\\\": 3, \\\"does\\\": 23, \\\"being\\\": 3, \\\"entail\\\": 1, \\\"function\\\": 30, \\\"members\\\": 1, \\\"define\\\": 105, \\\"pointer\\\": 4, \\\"this\\\": 4, \\\"the\\\": 28, \\\"do\\\": 13, \\\"an\\\": 34, \\\"error\\\": 26, \\\"overflow\\\": 8, \\\"errors\\\": 1, \\\"cya\\\": 1, \\\"later\\\": 1, \\\"see\\\": 1, \\\"goodbye\\\": 1, \\\"i\\\": 1, \\\"leaving\\\": 1, \\\"am\\\": 1, \\\"have\\\": 1, \\\"compiler\\\": 4, \\\"c\\\": 9, \\\"visual\\\": 1, \\\"studio\\\": 1, \\\"polymorphism\\\": 3, \\\"classes\\\": 9, \\\"in\\\": 22, \\\"functions\\\": 4, \\\"inheritance\\\": 8, \\\"use\\\": 2, \\\"describe\\\": 44, \\\"header\\\": 6, \\\"file\\\": 12, \\\"h\\\": 1, \\\"files\\\": 1, \\\"data\\\": 13, \\\"types\\\": 3, \\\"many\\\": 2, \\\"stored\\\": 2, \\\"top\\\": 2, \\\"design\\\": 2, \\\"down\\\": 2, \\\"refinement\\\": 1, \\\"explain\\\": 8, \\\"stepwise\\\": 1, \\\"by\\\": 9, \\\"meant\\\": 7, \\\"flow\\\": 3, \\\"chart\\\": 4, \\\"purpose\\\": 4, \\\"flowchart\\\": 2, \\\"pseudocode\\\": 3, \\\"sequence\\\": 4, \\\"structure\\\": 14, \\\"programming\\\": 2, \\\"conditional\\\": 4, \\\"selection\\\": 5, \\\"loop\\\": 21, \\\"repetition\\\": 1, \\\"iteration\\\": 1, \\\"operator\\\": 17, \\\"relational\\\": 2, \\\"operators\\\": 1, \\\"array\\\": 41, \\\"to\\\": 26, \\\"declare\\\": 2, \\\"initialize\\\": 1, \\\"for\\\": 10, \\\"me\\\": 1, \\\"method\\\": 4, \\\"declaration\\\": 5, \\\"one\\\": 3, \\\"dimensional\\\": 1, \\\"elements\\\": 5, \\\"made\\\": 1, \\\"offsets\\\": 2, \\\"offset\\\": 3, \\\"arrays\\\": 2, \\\"size\\\": 9, \\\"we\\\": 8, \\\"constant\\\": 4, \\\"maximum\\\": 1, \\\"can\\\": 7, \\\"be\\\": 1, \\\"sorting\\\": 4, \\\"algorithm\\\": 2, \\\"sort\\\": 7, \\\"vector\\\": 1, \\\"find\\\": 4, \\\"ascending\\\": 1, \\\"descending\\\": 1, \\\"search\\\": 7, \\\"algorithms\\\": 1, \\\"value\\\": 6, \\\"element\\\": 2, \\\"sequential\\\": 2, \\\"binary\\\": 1, \\\"ordered\\\": 1, \\\"faster\\\": 1, \\\"cstyle\\\": 7, \\\"string\\\": 17, \\\"char\\\": 4, \\\"character\\\": 8, \\\"between\\\": 4, \\\"normal\\\": 3, \\\"difference\\\": 3, \\\"and\\\": 8, \\\"differentiate\\\": 1, \\\"more\\\": 1, \\\"assign\\\": 1, \\\"than\\\": 1, \\\"exceed\\\": 2, \\\"cstring\\\": 2, \\\"list\\\": 4, \\\"library\\\": 5, \\\"strlen\\\": 2, \\\"length\\\": 2, \\\"return\\\": 4, \\\"strcpy\\\": 4, \\\"copy\\\": 2, \\\"strings\\\": 2, \\\"another\\\": 2, \\\"strcat\\\": 5, \\\"join\\\": 1, \\\"concatenate\\\": 1, \\\"strcmp\\\": 4, \\\"compare\\\": 2, \\\"ascii\\\": 1, \\\"values\\\": 1, \\\"type\\\": 4, \\\"add\\\": 2, \\\"get\\\": 2, \\\"empty\\\": 4, \\\"know\\\": 1, \\\"or\\\": 4, \\\"not\\\": 4, \\\"if\\\": 8, \\\"substr\\\": 2, \\\"edit\\\": 1, \\\"part\\\": 1, \\\"specific\\\": 1, \\\"cstr\\\": 3, \\\"filename\\\": 1, \\\"logical\\\": 5, \\\"operation\\\": 1, \\\"behind\\\": 3, \\\"logic\\\": 3, \\\"true\\\": 3, \\\"truth\\\": 3, \\\"table\\\": 3, \\\"circuiting\\\": 4, \\\"short\\\": 7, \\\"statement\\\": 14, \\\"alone\\\": 1, \\\"work\\\": 11, \\\"stand\\\": 1, \\\"else\\\": 2, \\\"nested\\\": 2, \\\"used\\\": 4, \\\"why\\\": 4, \\\"switch\\\": 3, \\\"fuction\\\": 1, \\\"break\\\": 4, \\\"inside\\\": 1, \\\"case\\\": 1, \\\"overloading\\\": 3, \\\"expression\\\": 4, \\\"controlling\\\": 2, \\\"test\\\": 3, \\\"comment\\\": 6, \\\"write\\\": 1, \\\"application\\\": 1, \\\"preprocessor\\\": 3, \\\"directive\\\": 6, \\\"include\\\": 3, \\\"iostream\\\": 3, \\\"cmath\\\": 3, \\\"namespace\\\": 3, \\\"using\\\": 3, \\\"code\\\": 3, \\\"block\\\": 3, \\\"main\\\": 3, \\\"variable\\\": 3, \\\"snapshot\\\": 3, \\\"memory\\\": 3, \\\"int\\\": 3, \\\"long\\\": 6, \\\"float\\\": 3, \\\"double\\\": 6, \\\"bool\\\": 3, \\\"boolean\\\": 3, \\\"implementation\\\": 3, \\\"truncated\\\": 3, \\\"result\\\": 3, \\\"underflow\\\": 3, \\\"undeflow\\\": 1, \\\"cin\\\": 3, \\\"cout\\\": 3, \\\"syntax\\\": 6, \\\"parse\\\": 3, \\\"execution\\\": 3, \\\"runtime\\\": 3, \\\"while\\\": 7, \\\"loops\\\": 4, \\\"modification\\\": 2, \\\"update\\\": 1, \\\"command\\\": 2, \\\"continue\\\": 3, \\\"controlled\\\": 6, \\\"counter\\\": 2, \\\"sentinel\\\": 2, \\\"end\\\": 2, \\\"kind\\\": 1, \\\"infinite\\\": 2, \\\"terminate\\\": 1, \\\"modularity\\\": 6, \\\"required\\\": 1, \\\"modules\\\": 3, \\\"needed\\\": 1, \\\"abstraction\\\": 3, \\\"advantages\\\": 2, \\\"charts\\\": 2, \\\"drivers\\\": 1, \\\"driver\\\": 2, \\\"definition\\\": 2, \\\"parameter\\\": 6, \\\"body\\\": 2, \\\"prototype\\\": 3, \\\"scope\\\": 4, \\\"custom\\\": 3, \\\"fine\\\": 1, \\\"parameters\\\": 2, \\\"formal\\\": 2, \\\"actual\\\": 3, \\\"pass\\\": 2, \\\"storage\\\": 7, \\\"automatic\\\": 1, \\\"auto\\\": 1, \\\"static\\\": 3, \\\"seed\\\": 3, \\\"number\\\": 3, \\\"random\\\": 3, \\\"mutator\\\": 3, \\\"methods\\\": 3, \\\"standard\\\": 3, \\\"stream\\\": 3, \\\"multiple\\\": 3, \\\"endoffile\\\": 3, \\\"signal\\\": 3, \\\"trailer\\\": 3, \\\"state\\\": 6, \\\"whitespace\\\": 3, \\\"flags\\\": 3, \\\"summation\\\": 3, \\\"notation\\\": 3}\", \"index_docs\": \"{\\\"209\\\": 1, \\\"23\\\": 14, \\\"6\\\": 51, \\\"96\\\": 3, \\\"3\\\": 163, \\\"210\\\": 1, \\\"163\\\": 2, \\\"211\\\": 1, \\\"165\\\": 2, \\\"164\\\": 2, \\\"213\\\": 1, \\\"212\\\": 1, \\\"2\\\": 176, \\\"5\\\": 90, \\\"59\\\": 5, \\\"68\\\": 4, \\\"12\\\": 28, \\\"18\\\": 20, \\\"98\\\": 3, \\\"15\\\": 23, \\\"97\\\": 3, \\\"214\\\": 1, \\\"11\\\": 30, \\\"215\\\": 1, \\\"4\\\": 105, \\\"70\\\": 4, \\\"69\\\": 4, \\\"10\\\": 28, \\\"21\\\": 13, \\\"9\\\": 34, \\\"14\\\": 26, \\\"34\\\": 8, \\\"216\\\": 1, \\\"217\\\": 1, \\\"219\\\": 1, \\\"218\\\": 1, \\\"220\\\": 1, \\\"221\\\": 1, \\\"223\\\": 1, \\\"222\\\": 1, \\\"224\\\": 1, \\\"71\\\": 4, \\\"30\\\": 9, \\\"225\\\": 1, \\\"226\\\": 1, \\\"99\\\": 3, \\\"31\\\": 9, \\\"16\\\": 22, \\\"72\\\": 4, \\\"35\\\": 8, \\\"166\\\": 2, \\\"7\\\": 44, \\\"48\\\": 6, \\\"26\\\": 12, \\\"227\\\": 1, \\\"228\\\": 1, \\\"25\\\": 13, \\\"100\\\": 3, \\\"167\\\": 2, \\\"168\\\": 2, \\\"169\\\": 2, \\\"171\\\": 2, \\\"170\\\": 2, \\\"230\\\": 1, \\\"36\\\": 8, \\\"229\\\": 1, \\\"32\\\": 9, \\\"42\\\": 7, \\\"101\\\": 3, \\\"73\\\": 4, \\\"74\\\": 4, \\\"172\\\": 2, \\\"102\\\": 3, \\\"75\\\": 4, \\\"24\\\": 14, \\\"173\\\": 2, \\\"76\\\": 4, \\\"60\\\": 5, \\\"17\\\": 21, \\\"231\\\": 1, \\\"232\\\": 1, \\\"19\\\": 17, \\\"174\\\": 2, \\\"233\\\": 1, \\\"8\\\": 41, \\\"13\\\": 26, \\\"175\\\": 2, \\\"234\\\": 1, \\\"28\\\": 10, \\\"235\\\": 1, \\\"77\\\": 4, \\\"61\\\": 5, \\\"103\\\": 3, \\\"236\\\": 1, \\\"62\\\": 5, \\\"237\\\": 1, \\\"176\\\": 2, \\\"104\\\": 3, \\\"177\\\": 2, \\\"33\\\": 9, \\\"37\\\": 8, \\\"78\\\": 4, \\\"238\\\": 1, \\\"43\\\": 7, \\\"239\\\": 1, \\\"79\\\": 4, \\\"178\\\": 2, \\\"44\\\": 7, \\\"240\\\": 1, \\\"80\\\": 4, \\\"241\\\": 1, \\\"242\\\": 1, \\\"45\\\": 7, \\\"243\\\": 1, \\\"49\\\": 6, \\\"179\\\": 2, \\\"180\\\": 2, \\\"244\\\": 1, \\\"245\\\": 1, \\\"246\\\": 1, \\\"46\\\": 7, \\\"20\\\": 17, \\\"81\\\": 4, \\\"38\\\": 8, \\\"82\\\": 4, \\\"106\\\": 3, \\\"105\\\": 3, \\\"39\\\": 8, \\\"247\\\": 1, \\\"249\\\": 1, \\\"248\\\": 1, \\\"250\\\": 1, \\\"181\\\": 2, \\\"182\\\": 2, \\\"83\\\": 4, \\\"63\\\": 5, \\\"183\\\": 2, \\\"184\\\": 2, \\\"84\\\": 4, \\\"85\\\": 4, \\\"185\\\": 2, \\\"186\\\": 2, \\\"187\\\": 2, \\\"64\\\": 5, \\\"251\\\": 1, \\\"252\\\": 1, \\\"86\\\": 4, \\\"188\\\": 2, \\\"253\\\": 1, \\\"254\\\": 1, \\\"87\\\": 4, \\\"189\\\": 2, \\\"190\\\": 2, \\\"88\\\": 4, \\\"255\\\": 1, \\\"89\\\": 4, \\\"90\\\": 4, \\\"40\\\": 8, \\\"191\\\": 2, \\\"256\\\": 1, \\\"258\\\": 1, \\\"257\\\": 1, \\\"107\\\": 3, \\\"259\\\": 1, \\\"65\\\": 5, \\\"260\\\": 1, \\\"109\\\": 3, \\\"108\\\": 3, \\\"110\\\": 3, \\\"111\\\": 3, \\\"112\\\": 3, \\\"91\\\": 4, \\\"47\\\": 7, \\\"22\\\": 14, \\\"262\\\": 1, \\\"27\\\": 11, \\\"261\\\": 1, \\\"192\\\": 2, \\\"193\\\": 2, \\\"93\\\": 4, \\\"92\\\": 4, \\\"113\\\": 3, \\\"263\\\": 1, \\\"66\\\": 4, \\\"264\\\": 1, \\\"265\\\": 1, \\\"114\\\": 3, \\\"94\\\": 4, \\\"194\\\": 2, \\\"115\\\": 3, \\\"50\\\": 6, \\\"266\\\": 1, \\\"267\\\": 1, \\\"116\\\": 3, \\\"51\\\": 6, \\\"117\\\": 3, \\\"118\\\": 3, \\\"119\\\": 3, \\\"120\\\": 3, \\\"121\\\": 3, \\\"122\\\": 3, \\\"123\\\": 3, \\\"124\\\": 3, \\\"125\\\": 3, \\\"127\\\": 3, \\\"126\\\": 3, \\\"128\\\": 3, \\\"52\\\": 6, \\\"129\\\": 3, \\\"53\\\": 6, \\\"130\\\": 3, \\\"131\\\": 3, \\\"132\\\": 3, \\\"133\\\": 3, \\\"134\\\": 3, \\\"135\\\": 3, \\\"268\\\": 1, \\\"136\\\": 3, \\\"137\\\": 3, \\\"54\\\": 6, \\\"138\\\": 3, \\\"139\\\": 3, \\\"140\\\": 3, \\\"29\\\": 7, \\\"67\\\": 4, \\\"195\\\": 2, \\\"269\\\": 1, \\\"196\\\": 2, \\\"141\\\": 3, \\\"55\\\": 6, \\\"197\\\": 2, \\\"198\\\": 2, \\\"199\\\": 2, \\\"270\\\": 1, \\\"200\\\": 2, \\\"271\\\": 1, \\\"56\\\": 6, \\\"272\\\": 1, \\\"142\\\": 3, \\\"273\\\": 1, \\\"143\\\": 3, \\\"201\\\": 2, \\\"202\\\": 2, \\\"274\\\": 1, \\\"203\\\": 2, \\\"204\\\": 2, \\\"57\\\": 6, \\\"205\\\": 2, \\\"144\\\": 3, \\\"95\\\": 4, \\\"145\\\": 3, \\\"275\\\": 1, \\\"207\\\": 2, \\\"206\\\": 2, \\\"146\\\": 3, \\\"208\\\": 2, \\\"41\\\": 7, \\\"276\\\": 1, \\\"277\\\": 1, \\\"147\\\": 3, \\\"150\\\": 3, \\\"149\\\": 3, \\\"148\\\": 3, \\\"151\\\": 3, \\\"152\\\": 3, \\\"153\\\": 3, \\\"154\\\": 3, \\\"155\\\": 3, \\\"156\\\": 3, \\\"158\\\": 3, \\\"157\\\": 3, \\\"58\\\": 6, \\\"159\\\": 3, \\\"160\\\": 3, \\\"161\\\": 3, \\\"162\\\": 3}\", \"index_word\": \"{\\\"1\\\": \\\"UNK\\\", \\\"2\\\": \\\"what\\\", \\\"3\\\": \\\"is\\\", \\\"4\\\": \\\"define\\\", \\\"5\\\": \\\"a\\\", \\\"6\\\": \\\"how\\\", \\\"7\\\": \\\"describe\\\", \\\"8\\\": \\\"array\\\", \\\"9\\\": \\\"an\\\", \\\"10\\\": \\\"the\\\", \\\"11\\\": \\\"function\\\", \\\"12\\\": \\\"of\\\", \\\"13\\\": \\\"to\\\", \\\"14\\\": \\\"error\\\", \\\"15\\\": \\\"does\\\", \\\"16\\\": \\\"in\\\", \\\"17\\\": \\\"loop\\\", \\\"18\\\": \\\"class\\\", \\\"19\\\": \\\"operator\\\", \\\"20\\\": \\\"string\\\", \\\"21\\\": \\\"do\\\", \\\"22\\\": \\\"statement\\\", \\\"23\\\": \\\"are\\\", \\\"24\\\": \\\"structure\\\", \\\"25\\\": \\\"data\\\", \\\"26\\\": \\\"file\\\", \\\"27\\\": \\\"work\\\", \\\"28\\\": \\\"for\\\", \\\"29\\\": \\\"while\\\", \\\"30\\\": \\\"c\\\", \\\"31\\\": \\\"classes\\\", \\\"32\\\": \\\"by\\\", \\\"33\\\": \\\"size\\\", \\\"34\\\": \\\"overflow\\\", \\\"35\\\": \\\"inheritance\\\", \\\"36\\\": \\\"explain\\\", \\\"37\\\": \\\"we\\\", \\\"38\\\": \\\"character\\\", \\\"39\\\": \\\"and\\\", \\\"40\\\": \\\"if\\\", \\\"41\\\": \\\"storage\\\", \\\"42\\\": \\\"meant\\\", \\\"43\\\": \\\"can\\\", \\\"44\\\": \\\"sort\\\", \\\"45\\\": \\\"search\\\", \\\"46\\\": \\\"cstyle\\\", \\\"47\\\": \\\"short\\\", \\\"48\\\": \\\"header\\\", \\\"49\\\": \\\"value\\\", \\\"50\\\": \\\"comment\\\", \\\"51\\\": \\\"directive\\\", \\\"52\\\": \\\"long\\\", \\\"53\\\": \\\"double\\\", \\\"54\\\": \\\"syntax\\\", \\\"55\\\": \\\"controlled\\\", \\\"56\\\": \\\"modularity\\\", \\\"57\\\": \\\"parameter\\\", \\\"58\\\": \\\"state\\\", \\\"59\\\": \\\"protected\\\", \\\"60\\\": \\\"selection\\\", \\\"61\\\": \\\"declaration\\\", \\\"62\\\": \\\"elements\\\", \\\"63\\\": \\\"library\\\", \\\"64\\\": \\\"strcat\\\", \\\"65\\\": \\\"logical\\\", \\\"66\\\": \\\"break\\\", \\\"67\\\": \\\"loops\\\", \\\"68\\\": \\\"member\\\", \\\"69\\\": \\\"this\\\", \\\"70\\\": \\\"pointer\\\", \\\"71\\\": \\\"compiler\\\", \\\"72\\\": \\\"functions\\\", \\\"73\\\": \\\"chart\\\", \\\"74\\\": \\\"purpose\\\", \\\"75\\\": \\\"sequence\\\", \\\"76\\\": \\\"conditional\\\", \\\"77\\\": \\\"method\\\", \\\"78\\\": \\\"constant\\\", \\\"79\\\": \\\"sorting\\\", \\\"80\\\": \\\"find\\\", \\\"81\\\": \\\"char\\\", \\\"82\\\": \\\"between\\\", \\\"83\\\": \\\"list\\\", \\\"84\\\": \\\"return\\\", \\\"85\\\": \\\"strcpy\\\", \\\"86\\\": \\\"strcmp\\\", \\\"87\\\": \\\"type\\\", \\\"88\\\": \\\"empty\\\", \\\"89\\\": \\\"or\\\", \\\"90\\\": \\\"not\\\", \\\"91\\\": \\\"circuiting\\\", \\\"92\\\": \\\"why\\\", \\\"93\\\": \\\"used\\\", \\\"94\\\": \\\"expression\\\", \\\"95\\\": \\\"scope\\\", \\\"96\\\": \\\"you\\\", \\\"97\\\": \\\"being\\\", \\\"98\\\": \\\"mean\\\", \\\"99\\\": \\\"polymorphism\\\", \\\"100\\\": \\\"types\\\", \\\"101\\\": \\\"flow\\\", \\\"102\\\": \\\"pseudocode\\\", \\\"103\\\": \\\"one\\\", \\\"104\\\": \\\"offset\\\", \\\"105\\\": \\\"difference\\\", \\\"106\\\": \\\"normal\\\", \\\"107\\\": \\\"cstr\\\", \\\"108\\\": \\\"logic\\\", \\\"109\\\": \\\"behind\\\", \\\"110\\\": \\\"true\\\", \\\"111\\\": \\\"truth\\\", \\\"112\\\": \\\"table\\\", \\\"113\\\": \\\"switch\\\", \\\"114\\\": \\\"overloading\\\", \\\"115\\\": \\\"test\\\", \\\"116\\\": \\\"preprocessor\\\", \\\"117\\\": \\\"include\\\", \\\"118\\\": \\\"iostream\\\", \\\"119\\\": \\\"cmath\\\", \\\"120\\\": \\\"namespace\\\", \\\"121\\\": \\\"using\\\", \\\"122\\\": \\\"code\\\", \\\"123\\\": \\\"block\\\", \\\"124\\\": \\\"main\\\", \\\"125\\\": \\\"variable\\\", \\\"126\\\": \\\"memory\\\", \\\"127\\\": \\\"snapshot\\\", \\\"128\\\": \\\"int\\\", \\\"129\\\": \\\"float\\\", \\\"130\\\": \\\"bool\\\", \\\"131\\\": \\\"boolean\\\", \\\"132\\\": \\\"implementation\\\", \\\"133\\\": \\\"truncated\\\", \\\"134\\\": \\\"result\\\", \\\"135\\\": \\\"underflow\\\", \\\"136\\\": \\\"cin\\\", \\\"137\\\": \\\"cout\\\", \\\"138\\\": \\\"parse\\\", \\\"139\\\": \\\"execution\\\", \\\"140\\\": \\\"runtime\\\", \\\"141\\\": \\\"continue\\\", \\\"142\\\": \\\"modules\\\", \\\"143\\\": \\\"abstraction\\\", \\\"144\\\": \\\"prototype\\\", \\\"145\\\": \\\"custom\\\", \\\"146\\\": \\\"actual\\\", \\\"147\\\": \\\"static\\\", \\\"148\\\": \\\"random\\\", \\\"149\\\": \\\"number\\\", \\\"150\\\": \\\"seed\\\", \\\"151\\\": \\\"mutator\\\", \\\"152\\\": \\\"methods\\\", \\\"153\\\": \\\"standard\\\", \\\"154\\\": \\\"stream\\\", \\\"155\\\": \\\"multiple\\\", \\\"156\\\": \\\"endoffile\\\", \\\"157\\\": \\\"trailer\\\", \\\"158\\\": \\\"signal\\\", \\\"159\\\": \\\"whitespace\\\", \\\"160\\\": \\\"flags\\\", \\\"161\\\": \\\"summation\\\", \\\"162\\\": \\\"notation\\\", \\\"163\\\": \\\"there\\\", \\\"164\\\": \\\"good\\\", \\\"165\\\": \\\"day\\\", \\\"166\\\": \\\"use\\\", \\\"167\\\": \\\"many\\\", \\\"168\\\": \\\"stored\\\", \\\"169\\\": \\\"top\\\", \\\"170\\\": \\\"down\\\", \\\"171\\\": \\\"design\\\", \\\"172\\\": \\\"flowchart\\\", \\\"173\\\": \\\"programming\\\", \\\"174\\\": \\\"relational\\\", \\\"175\\\": \\\"declare\\\", \\\"176\\\": \\\"offsets\\\", \\\"177\\\": \\\"arrays\\\", \\\"178\\\": \\\"algorithm\\\", \\\"179\\\": \\\"element\\\", \\\"180\\\": \\\"sequential\\\", \\\"181\\\": \\\"exceed\\\", \\\"182\\\": \\\"cstring\\\", \\\"183\\\": \\\"strlen\\\", \\\"184\\\": \\\"length\\\", \\\"185\\\": \\\"copy\\\", \\\"186\\\": \\\"strings\\\", \\\"187\\\": \\\"another\\\", \\\"188\\\": \\\"compare\\\", \\\"189\\\": \\\"add\\\", \\\"190\\\": \\\"get\\\", \\\"191\\\": \\\"substr\\\", \\\"192\\\": \\\"else\\\", \\\"193\\\": \\\"nested\\\", \\\"194\\\": \\\"controlling\\\", \\\"195\\\": \\\"modification\\\", \\\"196\\\": \\\"command\\\", \\\"197\\\": \\\"counter\\\", \\\"198\\\": \\\"sentinel\\\", \\\"199\\\": \\\"end\\\", \\\"200\\\": \\\"infinite\\\", \\\"201\\\": \\\"advantages\\\", \\\"202\\\": \\\"charts\\\", \\\"203\\\": \\\"driver\\\", \\\"204\\\": \\\"definition\\\", \\\"205\\\": \\\"body\\\", \\\"206\\\": \\\"formal\\\", \\\"207\\\": \\\"parameters\\\", \\\"208\\\": \\\"pass\\\", \\\"209\\\": \\\"hi\\\", \\\"210\\\": \\\"anyone\\\", \\\"211\\\": \\\"hello\\\", \\\"212\\\": \\\"what\\\\u00e2\\\\u20ac\\\\u2122s\\\", \\\"213\\\": \\\"up\\\", \\\"214\\\": \\\"entail\\\", \\\"215\\\": \\\"members\\\", \\\"216\\\": \\\"errors\\\", \\\"217\\\": \\\"cya\\\", \\\"218\\\": \\\"see\\\", \\\"219\\\": \\\"later\\\", \\\"220\\\": \\\"goodbye\\\", \\\"221\\\": \\\"i\\\", \\\"222\\\": \\\"am\\\", \\\"223\\\": \\\"leaving\\\", \\\"224\\\": \\\"have\\\", \\\"225\\\": \\\"visual\\\", \\\"226\\\": \\\"studio\\\", \\\"227\\\": \\\"h\\\", \\\"228\\\": \\\"files\\\", \\\"229\\\": \\\"stepwise\\\", \\\"230\\\": \\\"refinement\\\", \\\"231\\\": \\\"repetition\\\", \\\"232\\\": \\\"iteration\\\", \\\"233\\\": \\\"operators\\\", \\\"234\\\": \\\"initialize\\\", \\\"235\\\": \\\"me\\\", \\\"236\\\": \\\"dimensional\\\", \\\"237\\\": \\\"made\\\", \\\"238\\\": \\\"maximum\\\", \\\"239\\\": \\\"be\\\", \\\"240\\\": \\\"vector\\\", \\\"241\\\": \\\"ascending\\\", \\\"242\\\": \\\"descending\\\", \\\"243\\\": \\\"algorithms\\\", \\\"244\\\": \\\"binary\\\", \\\"245\\\": \\\"ordered\\\", \\\"246\\\": \\\"faster\\\", \\\"247\\\": \\\"differentiate\\\", \\\"248\\\": \\\"assign\\\", \\\"249\\\": \\\"more\\\", \\\"250\\\": \\\"than\\\", \\\"251\\\": \\\"join\\\", \\\"252\\\": \\\"concatenate\\\", \\\"253\\\": \\\"ascii\\\", \\\"254\\\": \\\"values\\\", \\\"255\\\": \\\"know\\\", \\\"256\\\": \\\"edit\\\", \\\"257\\\": \\\"specific\\\", \\\"258\\\": \\\"part\\\", \\\"259\\\": \\\"filename\\\", \\\"260\\\": \\\"operation\\\", \\\"261\\\": \\\"stand\\\", \\\"262\\\": \\\"alone\\\", \\\"263\\\": \\\"fuction\\\", \\\"264\\\": \\\"inside\\\", \\\"265\\\": \\\"case\\\", \\\"266\\\": \\\"write\\\", \\\"267\\\": \\\"application\\\", \\\"268\\\": \\\"undeflow\\\", \\\"269\\\": \\\"update\\\", \\\"270\\\": \\\"kind\\\", \\\"271\\\": \\\"terminate\\\", \\\"272\\\": \\\"required\\\", \\\"273\\\": \\\"needed\\\", \\\"274\\\": \\\"drivers\\\", \\\"275\\\": \\\"fine\\\", \\\"276\\\": \\\"automatic\\\", \\\"277\\\": \\\"auto\\\"}\", \"word_index\": \"{\\\"UNK\\\": 1, \\\"what\\\": 2, \\\"is\\\": 3, \\\"define\\\": 4, \\\"a\\\": 5, \\\"how\\\": 6, \\\"describe\\\": 7, \\\"array\\\": 8, \\\"an\\\": 9, \\\"the\\\": 10, \\\"function\\\": 11, \\\"of\\\": 12, \\\"to\\\": 13, \\\"error\\\": 14, \\\"does\\\": 15, \\\"in\\\": 16, \\\"loop\\\": 17, \\\"class\\\": 18, \\\"operator\\\": 19, \\\"string\\\": 20, \\\"do\\\": 21, \\\"statement\\\": 22, \\\"are\\\": 23, \\\"structure\\\": 24, \\\"data\\\": 25, \\\"file\\\": 26, \\\"work\\\": 27, \\\"for\\\": 28, \\\"while\\\": 29, \\\"c\\\": 30, \\\"classes\\\": 31, \\\"by\\\": 32, \\\"size\\\": 33, \\\"overflow\\\": 34, \\\"inheritance\\\": 35, \\\"explain\\\": 36, \\\"we\\\": 37, \\\"character\\\": 38, \\\"and\\\": 39, \\\"if\\\": 40, \\\"storage\\\": 41, \\\"meant\\\": 42, \\\"can\\\": 43, \\\"sort\\\": 44, \\\"search\\\": 45, \\\"cstyle\\\": 46, \\\"short\\\": 47, \\\"header\\\": 48, \\\"value\\\": 49, \\\"comment\\\": 50, \\\"directive\\\": 51, \\\"long\\\": 52, \\\"double\\\": 53, \\\"syntax\\\": 54, \\\"controlled\\\": 55, \\\"modularity\\\": 56, \\\"parameter\\\": 57, \\\"state\\\": 58, \\\"protected\\\": 59, \\\"selection\\\": 60, \\\"declaration\\\": 61, \\\"elements\\\": 62, \\\"library\\\": 63, \\\"strcat\\\": 64, \\\"logical\\\": 65, \\\"break\\\": 66, \\\"loops\\\": 67, \\\"member\\\": 68, \\\"this\\\": 69, \\\"pointer\\\": 70, \\\"compiler\\\": 71, \\\"functions\\\": 72, \\\"chart\\\": 73, \\\"purpose\\\": 74, \\\"sequence\\\": 75, \\\"conditional\\\": 76, \\\"method\\\": 77, \\\"constant\\\": 78, \\\"sorting\\\": 79, \\\"find\\\": 80, \\\"char\\\": 81, \\\"between\\\": 82, \\\"list\\\": 83, \\\"return\\\": 84, \\\"strcpy\\\": 85, \\\"strcmp\\\": 86, \\\"type\\\": 87, \\\"empty\\\": 88, \\\"or\\\": 89, \\\"not\\\": 90, \\\"circuiting\\\": 91, \\\"why\\\": 92, \\\"used\\\": 93, \\\"expression\\\": 94, \\\"scope\\\": 95, \\\"you\\\": 96, \\\"being\\\": 97, \\\"mean\\\": 98, \\\"polymorphism\\\": 99, \\\"types\\\": 100, \\\"flow\\\": 101, \\\"pseudocode\\\": 102, \\\"one\\\": 103, \\\"offset\\\": 104, \\\"difference\\\": 105, \\\"normal\\\": 106, \\\"cstr\\\": 107, \\\"logic\\\": 108, \\\"behind\\\": 109, \\\"true\\\": 110, \\\"truth\\\": 111, \\\"table\\\": 112, \\\"switch\\\": 113, \\\"overloading\\\": 114, \\\"test\\\": 115, \\\"preprocessor\\\": 116, \\\"include\\\": 117, \\\"iostream\\\": 118, \\\"cmath\\\": 119, \\\"namespace\\\": 120, \\\"using\\\": 121, \\\"code\\\": 122, \\\"block\\\": 123, \\\"main\\\": 124, \\\"variable\\\": 125, \\\"memory\\\": 126, \\\"snapshot\\\": 127, \\\"int\\\": 128, \\\"float\\\": 129, \\\"bool\\\": 130, \\\"boolean\\\": 131, \\\"implementation\\\": 132, \\\"truncated\\\": 133, \\\"result\\\": 134, \\\"underflow\\\": 135, \\\"cin\\\": 136, \\\"cout\\\": 137, \\\"parse\\\": 138, \\\"execution\\\": 139, \\\"runtime\\\": 140, \\\"continue\\\": 141, \\\"modules\\\": 142, \\\"abstraction\\\": 143, \\\"prototype\\\": 144, \\\"custom\\\": 145, \\\"actual\\\": 146, \\\"static\\\": 147, \\\"random\\\": 148, \\\"number\\\": 149, \\\"seed\\\": 150, \\\"mutator\\\": 151, \\\"methods\\\": 152, \\\"standard\\\": 153, \\\"stream\\\": 154, \\\"multiple\\\": 155, \\\"endoffile\\\": 156, \\\"trailer\\\": 157, \\\"signal\\\": 158, \\\"whitespace\\\": 159, \\\"flags\\\": 160, \\\"summation\\\": 161, \\\"notation\\\": 162, \\\"there\\\": 163, \\\"good\\\": 164, \\\"day\\\": 165, \\\"use\\\": 166, \\\"many\\\": 167, \\\"stored\\\": 168, \\\"top\\\": 169, \\\"down\\\": 170, \\\"design\\\": 171, \\\"flowchart\\\": 172, \\\"programming\\\": 173, \\\"relational\\\": 174, \\\"declare\\\": 175, \\\"offsets\\\": 176, \\\"arrays\\\": 177, \\\"algorithm\\\": 178, \\\"element\\\": 179, \\\"sequential\\\": 180, \\\"exceed\\\": 181, \\\"cstring\\\": 182, \\\"strlen\\\": 183, \\\"length\\\": 184, \\\"copy\\\": 185, \\\"strings\\\": 186, \\\"another\\\": 187, \\\"compare\\\": 188, \\\"add\\\": 189, \\\"get\\\": 190, \\\"substr\\\": 191, \\\"else\\\": 192, \\\"nested\\\": 193, \\\"controlling\\\": 194, \\\"modification\\\": 195, \\\"command\\\": 196, \\\"counter\\\": 197, \\\"sentinel\\\": 198, \\\"end\\\": 199, \\\"infinite\\\": 200, \\\"advantages\\\": 201, \\\"charts\\\": 202, \\\"driver\\\": 203, \\\"definition\\\": 204, \\\"body\\\": 205, \\\"formal\\\": 206, \\\"parameters\\\": 207, \\\"pass\\\": 208, \\\"hi\\\": 209, \\\"anyone\\\": 210, \\\"hello\\\": 211, \\\"what\\\\u00e2\\\\u20ac\\\\u2122s\\\": 212, \\\"up\\\": 213, \\\"entail\\\": 214, \\\"members\\\": 215, \\\"errors\\\": 216, \\\"cya\\\": 217, \\\"see\\\": 218, \\\"later\\\": 219, \\\"goodbye\\\": 220, \\\"i\\\": 221, \\\"am\\\": 222, \\\"leaving\\\": 223, \\\"have\\\": 224, \\\"visual\\\": 225, \\\"studio\\\": 226, \\\"h\\\": 227, \\\"files\\\": 228, \\\"stepwise\\\": 229, \\\"refinement\\\": 230, \\\"repetition\\\": 231, \\\"iteration\\\": 232, \\\"operators\\\": 233, \\\"initialize\\\": 234, \\\"me\\\": 235, \\\"dimensional\\\": 236, \\\"made\\\": 237, \\\"maximum\\\": 238, \\\"be\\\": 239, \\\"vector\\\": 240, \\\"ascending\\\": 241, \\\"descending\\\": 242, \\\"algorithms\\\": 243, \\\"binary\\\": 244, \\\"ordered\\\": 245, \\\"faster\\\": 246, \\\"differentiate\\\": 247, \\\"assign\\\": 248, \\\"more\\\": 249, \\\"than\\\": 250, \\\"join\\\": 251, \\\"concatenate\\\": 252, \\\"ascii\\\": 253, \\\"values\\\": 254, \\\"know\\\": 255, \\\"edit\\\": 256, \\\"specific\\\": 257, \\\"part\\\": 258, \\\"filename\\\": 259, \\\"operation\\\": 260, \\\"stand\\\": 261, \\\"alone\\\": 262, \\\"fuction\\\": 263, \\\"inside\\\": 264, \\\"case\\\": 265, \\\"write\\\": 266, \\\"application\\\": 267, \\\"undeflow\\\": 268, \\\"update\\\": 269, \\\"kind\\\": 270, \\\"terminate\\\": 271, \\\"required\\\": 272, \\\"needed\\\": 273, \\\"drivers\\\": 274, \\\"fine\\\": 275, \\\"automatic\\\": 276, \\\"auto\\\": 277}\"}}"