"{\"class_name\": \"Tokenizer\", \"config\": {\"num_words\": 292, \"filters\": \"!\\\"#$%&()*+,-./:;<=>?@[\\\\]^_`{|}~\\t\\n\", \"lower\": true, \"split\": \" \", \"char_level\": false, \"oov_token\": null, \"document_count\": 449, \"word_counts\": \"{\\\"hi\\\": 1, \\\"how\\\": 51, \\\"are\\\": 14, \\\"you\\\": 3, \\\"is\\\": 163, \\\"anyone\\\": 1, \\\"there\\\": 2, \\\"hello\\\": 1, \\\"good\\\": 2, \\\"day\\\": 2, \\\"what\\\\u00e2\\\\u20ac\\\\u2122s\\\": 1, \\\"up\\\": 1, \\\"what\\\": 177, \\\"a\\\": 94, \\\"protected\\\": 5, \\\"member\\\": 4, \\\"does\\\": 24, \\\"being\\\": 3, \\\"of\\\": 28, \\\"class\\\": 20, \\\"mean\\\": 3, \\\"entail\\\": 1, \\\"function\\\": 30, \\\"define\\\": 105, \\\"members\\\": 1, \\\"the\\\": 32, \\\"this\\\": 4, \\\"pointer\\\": 4, \\\"do\\\": 16, \\\"an\\\": 36, \\\"overflow\\\": 8, \\\"error\\\": 26, \\\"errors\\\": 1, \\\"cya\\\": 1, \\\"see\\\": 1, \\\"later\\\": 1, \\\"goodbye\\\": 1, \\\"i\\\": 1, \\\"am\\\": 1, \\\"leaving\\\": 1, \\\"have\\\": 1, \\\"c\\\": 9, \\\"compiler\\\": 4, \\\"visual\\\": 1, \\\"studio\\\": 1, \\\"polymorphism\\\": 3, \\\"classes\\\": 9, \\\"in\\\": 23, \\\"functions\\\": 4, \\\"inheritance\\\": 8, \\\"use\\\": 2, \\\"describe\\\": 44, \\\"header\\\": 6, \\\"file\\\": 12, \\\"h\\\": 1, \\\"files\\\": 1, \\\"data\\\": 13, \\\"types\\\": 3, \\\"many\\\": 2, \\\"stored\\\": 2, \\\"top\\\": 2, \\\"down\\\": 2, \\\"design\\\": 2, \\\"explain\\\": 8, \\\"stepwise\\\": 1, \\\"refinement\\\": 1, \\\"meant\\\": 7, \\\"by\\\": 9, \\\"flow\\\": 3, \\\"chart\\\": 4, \\\"purpose\\\": 4, \\\"flowchart\\\": 2, \\\"pseudocode\\\": 3, \\\"sequence\\\": 4, \\\"structure\\\": 14, \\\"programming\\\": 2, \\\"conditional\\\": 4, \\\"selection\\\": 5, \\\"loop\\\": 22, \\\"repetition\\\": 1, \\\"iteration\\\": 1, \\\"relational\\\": 2, \\\"operator\\\": 17, \\\"operators\\\": 1, \\\"to\\\": 28, \\\"declare\\\": 2, \\\"array\\\": 42, \\\"initialize\\\": 1, \\\"method\\\": 4, \\\"for\\\": 10, \\\"me\\\": 1, \\\"declaration\\\": 5, \\\"one\\\": 3, \\\"dimensional\\\": 1, \\\"elements\\\": 5, \\\"made\\\": 1, \\\"offsets\\\": 2, \\\"offset\\\": 3, \\\"arrays\\\": 2, \\\"size\\\": 9, \\\"we\\\": 8, \\\"constant\\\": 4, \\\"maximum\\\": 1, \\\"can\\\": 7, \\\"be\\\": 1, \\\"sorting\\\": 4, \\\"algorithm\\\": 2, \\\"sort\\\": 7, \\\"vector\\\": 1, \\\"find\\\": 4, \\\"ascending\\\": 1, \\\"descending\\\": 1, \\\"search\\\": 7, \\\"algorithms\\\": 1, \\\"value\\\": 6, \\\"element\\\": 2, \\\"sequential\\\": 2, \\\"binary\\\": 1, \\\"ordered\\\": 1, \\\"faster\\\": 1, \\\"cstyle\\\": 7, \\\"string\\\": 17, \\\"char\\\": 4, \\\"character\\\": 8, \\\"difference\\\": 3, \\\"between\\\": 4, \\\"and\\\": 8, \\\"normal\\\": 3, \\\"differentiate\\\": 1, \\\"assign\\\": 1, \\\"more\\\": 1, \\\"than\\\": 1, \\\"exceed\\\": 2, \\\"cstring\\\": 2, \\\"list\\\": 4, \\\"library\\\": 5, \\\"strlen\\\": 2, \\\"length\\\": 2, \\\"return\\\": 4, \\\"strcpy\\\": 4, \\\"copy\\\": 2, \\\"strings\\\": 2, \\\"another\\\": 2, \\\"strcat\\\": 5, \\\"join\\\": 1, \\\"concatenate\\\": 1, \\\"strcmp\\\": 4, \\\"compare\\\": 2, \\\"ascii\\\": 1, \\\"values\\\": 1, \\\"type\\\": 4, \\\"add\\\": 2, \\\"get\\\": 2, \\\"empty\\\": 4, \\\"know\\\": 1, \\\"if\\\": 8, \\\"or\\\": 4, \\\"not\\\": 4, \\\"substr\\\": 2, \\\"edit\\\": 1, \\\"specific\\\": 1, \\\"part\\\": 1, \\\"cstr\\\": 3, \\\"filename\\\": 1, \\\"logical\\\": 5, \\\"operation\\\": 1, \\\"logic\\\": 3, \\\"behind\\\": 3, \\\"true\\\": 3, \\\"truth\\\": 3, \\\"table\\\": 3, \\\"short\\\": 7, \\\"circuiting\\\": 4, \\\"statement\\\": 15, \\\"stand\\\": 1, \\\"alone\\\": 1, \\\"work\\\": 11, \\\"else\\\": 2, \\\"nested\\\": 2, \\\"why\\\": 4, \\\"used\\\": 4, \\\"switch\\\": 3, \\\"fuction\\\": 1, \\\"break\\\": 5, \\\"inside\\\": 1, \\\"case\\\": 1, \\\"overloading\\\": 3, \\\"controlling\\\": 2, \\\"expression\\\": 4, \\\"test\\\": 3, \\\"comment\\\": 6, \\\"write\\\": 1, \\\"application\\\": 1, \\\"preprocessor\\\": 3, \\\"directive\\\": 6, \\\"include\\\": 3, \\\"iostream\\\": 3, \\\"cmath\\\": 3, \\\"namespace\\\": 3, \\\"using\\\": 3, \\\"code\\\": 3, \\\"block\\\": 3, \\\"main\\\": 3, \\\"variable\\\": 3, \\\"memory\\\": 3, \\\"snapshot\\\": 3, \\\"int\\\": 3, \\\"long\\\": 6, \\\"float\\\": 3, \\\"double\\\": 6, \\\"bool\\\": 3, \\\"boolean\\\": 3, \\\"implementation\\\": 3, \\\"truncated\\\": 3, \\\"result\\\": 3, \\\"underflow\\\": 3, \\\"undeflow\\\": 1, \\\"cin\\\": 3, \\\"cout\\\": 3, \\\"syntax\\\": 6, \\\"parse\\\": 3, \\\"execution\\\": 3, \\\"runtime\\\": 3, \\\"while\\\": 10, \\\"modification\\\": 2, \\\"loops\\\": 5, \\\"update\\\": 1, \\\"command\\\": 2, \\\"continue\\\": 3, \\\"counter\\\": 2, \\\"controlled\\\": 6, \\\"sentinel\\\": 2, \\\"end\\\": 2, \\\"kind\\\": 1, \\\"infinite\\\": 2, \\\"terminate\\\": 1, \\\"modularity\\\": 6, \\\"modules\\\": 3, \\\"required\\\": 1, \\\"needed\\\": 1, \\\"abstraction\\\": 3, \\\"advantages\\\": 2, \\\"charts\\\": 2, \\\"drivers\\\": 1, \\\"driver\\\": 2, \\\"definition\\\": 2, \\\"parameter\\\": 6, \\\"body\\\": 2, \\\"prototype\\\": 3, \\\"scope\\\": 4, \\\"custom\\\": 3, \\\"fine\\\": 1, \\\"formal\\\": 2, \\\"parameters\\\": 2, \\\"actual\\\": 3, \\\"pass\\\": 2, \\\"storage\\\": 8, \\\"automatic\\\": 1, \\\"auto\\\": 1, \\\"static\\\": 3, \\\"random\\\": 3, \\\"number\\\": 3, \\\"seed\\\": 3, \\\"mutator\\\": 3, \\\"methods\\\": 3, \\\"standard\\\": 3, \\\"stream\\\": 3, \\\"multiple\\\": 3, \\\"endoffile\\\": 3, \\\"trailer\\\": 3, \\\"signal\\\": 3, \\\"state\\\": 6, \\\"whitespace\\\": 3, \\\"flags\\\": 3, \\\"summation\\\": 3, \\\"notation\\\": 3}\", \"word_docs\": \"{\\\"hi\\\": 1, \\\"how\\\": 51, \\\"are\\\": 14, \\\"you\\\": 3, \\\"there\\\": 2, \\\"anyone\\\": 1, \\\"is\\\": 163, \\\"hello\\\": 1, \\\"good\\\": 2, \\\"day\\\": 2, \\\"up\\\": 1, \\\"what\\\\u00e2\\\\u20ac\\\\u2122s\\\": 1, \\\"member\\\": 4, \\\"what\\\": 176, \\\"a\\\": 90, \\\"protected\\\": 5, \\\"class\\\": 20, \\\"mean\\\": 3, \\\"does\\\": 23, \\\"of\\\": 28, \\\"being\\\": 3, \\\"entail\\\": 1, \\\"function\\\": 30, \\\"define\\\": 105, \\\"members\\\": 1, \\\"this\\\": 4, \\\"pointer\\\": 4, \\\"the\\\": 28, \\\"do\\\": 13, \\\"overflow\\\": 8, \\\"an\\\": 34, \\\"error\\\": 26, \\\"errors\\\": 1, \\\"cya\\\": 1, \\\"later\\\": 1, \\\"see\\\": 1, \\\"goodbye\\\": 1, \\\"i\\\": 1, \\\"am\\\": 1, \\\"leaving\\\": 1, \\\"have\\\": 1, \\\"c\\\": 9, \\\"compiler\\\": 4, \\\"visual\\\": 1, \\\"studio\\\": 1, \\\"polymorphism\\\": 3, \\\"classes\\\": 9, \\\"in\\\": 22, \\\"functions\\\": 4, \\\"inheritance\\\": 8, \\\"use\\\": 2, \\\"describe\\\": 44, \\\"header\\\": 6, \\\"file\\\": 12, \\\"h\\\": 1, \\\"files\\\": 1, \\\"types\\\": 3, \\\"data\\\": 13, \\\"many\\\": 2, \\\"stored\\\": 2, \\\"down\\\": 2, \\\"design\\\": 2, \\\"top\\\": 2, \\\"explain\\\": 8, \\\"refinement\\\": 1, \\\"stepwise\\\": 1, \\\"by\\\": 9, \\\"meant\\\": 7, \\\"flow\\\": 3, \\\"chart\\\": 4, \\\"purpose\\\": 4, \\\"flowchart\\\": 2, \\\"pseudocode\\\": 3, \\\"programming\\\": 2, \\\"sequence\\\": 4, \\\"structure\\\": 14, \\\"conditional\\\": 4, \\\"selection\\\": 5, \\\"loop\\\": 21, \\\"repetition\\\": 1, \\\"iteration\\\": 1, \\\"operator\\\": 17, \\\"relational\\\": 2, \\\"operators\\\": 1, \\\"array\\\": 41, \\\"declare\\\": 2, \\\"to\\\": 26, \\\"initialize\\\": 1, \\\"for\\\": 10, \\\"me\\\": 1, \\\"method\\\": 4, \\\"declaration\\\": 5, \\\"dimensional\\\": 1, \\\"one\\\": 3, \\\"elements\\\": 5, \\\"made\\\": 1, \\\"offsets\\\": 2, \\\"offset\\\": 3, \\\"arrays\\\": 2, \\\"size\\\": 9, \\\"we\\\": 8, \\\"constant\\\": 4, \\\"maximum\\\": 1, \\\"can\\\": 7, \\\"be\\\": 1, \\\"sorting\\\": 4, \\\"algorithm\\\": 2, \\\"sort\\\": 7, \\\"vector\\\": 1, \\\"find\\\": 4, \\\"ascending\\\": 1, \\\"descending\\\": 1, \\\"search\\\": 7, \\\"algorithms\\\": 1, \\\"value\\\": 6, \\\"element\\\": 2, \\\"sequential\\\": 2, \\\"binary\\\": 1, \\\"ordered\\\": 1, \\\"faster\\\": 1, \\\"cstyle\\\": 7, \\\"string\\\": 17, \\\"char\\\": 4, \\\"character\\\": 8, \\\"difference\\\": 3, \\\"between\\\": 4, \\\"and\\\": 8, \\\"normal\\\": 3, \\\"differentiate\\\": 1, \\\"assign\\\": 1, \\\"more\\\": 1, \\\"than\\\": 1, \\\"exceed\\\": 2, \\\"cstring\\\": 2, \\\"list\\\": 4, \\\"library\\\": 5, \\\"strlen\\\": 2, \\\"length\\\": 2, \\\"return\\\": 4, \\\"strcpy\\\": 4, \\\"copy\\\": 2, \\\"strings\\\": 2, \\\"another\\\": 2, \\\"strcat\\\": 5, \\\"join\\\": 1, \\\"concatenate\\\": 1, \\\"strcmp\\\": 4, \\\"compare\\\": 2, \\\"ascii\\\": 1, \\\"values\\\": 1, \\\"type\\\": 4, \\\"add\\\": 2, \\\"get\\\": 2, \\\"empty\\\": 4, \\\"not\\\": 4, \\\"if\\\": 8, \\\"or\\\": 4, \\\"know\\\": 1, \\\"substr\\\": 2, \\\"edit\\\": 1, \\\"part\\\": 1, \\\"specific\\\": 1, \\\"cstr\\\": 3, \\\"filename\\\": 1, \\\"logical\\\": 5, \\\"operation\\\": 1, \\\"behind\\\": 3, \\\"logic\\\": 3, \\\"true\\\": 3, \\\"truth\\\": 3, \\\"table\\\": 3, \\\"circuiting\\\": 4, \\\"short\\\": 7, \\\"statement\\\": 14, \\\"alone\\\": 1, \\\"stand\\\": 1, \\\"work\\\": 11, \\\"else\\\": 2, \\\"nested\\\": 2, \\\"why\\\": 4, \\\"used\\\": 4, \\\"switch\\\": 3, \\\"fuction\\\": 1, \\\"break\\\": 4, \\\"case\\\": 1, \\\"inside\\\": 1, \\\"overloading\\\": 3, \\\"expression\\\": 4, \\\"controlling\\\": 2, \\\"test\\\": 3, \\\"comment\\\": 6, \\\"write\\\": 1, \\\"application\\\": 1, \\\"directive\\\": 6, \\\"preprocessor\\\": 3, \\\"include\\\": 3, \\\"iostream\\\": 3, \\\"cmath\\\": 3, \\\"namespace\\\": 3, \\\"using\\\": 3, \\\"code\\\": 3, \\\"block\\\": 3, \\\"main\\\": 3, \\\"variable\\\": 3, \\\"snapshot\\\": 3, \\\"memory\\\": 3, \\\"int\\\": 3, \\\"long\\\": 6, \\\"float\\\": 3, \\\"double\\\": 6, \\\"bool\\\": 3, \\\"boolean\\\": 3, \\\"implementation\\\": 3, \\\"truncated\\\": 3, \\\"result\\\": 3, \\\"underflow\\\": 3, \\\"undeflow\\\": 1, \\\"cin\\\": 3, \\\"cout\\\": 3, \\\"syntax\\\": 6, \\\"parse\\\": 3, \\\"execution\\\": 3, \\\"runtime\\\": 3, \\\"while\\\": 7, \\\"loops\\\": 4, \\\"modification\\\": 2, \\\"update\\\": 1, \\\"command\\\": 2, \\\"continue\\\": 3, \\\"counter\\\": 2, \\\"controlled\\\": 6, \\\"sentinel\\\": 2, \\\"end\\\": 2, \\\"kind\\\": 1, \\\"infinite\\\": 2, \\\"terminate\\\": 1, \\\"modularity\\\": 6, \\\"required\\\": 1, \\\"modules\\\": 3, \\\"needed\\\": 1, \\\"abstraction\\\": 3, \\\"advantages\\\": 2, \\\"charts\\\": 2, \\\"drivers\\\": 1, \\\"driver\\\": 2, \\\"definition\\\": 2, \\\"parameter\\\": 6, \\\"body\\\": 2, \\\"prototype\\\": 3, \\\"scope\\\": 4, \\\"custom\\\": 3, \\\"fine\\\": 1, \\\"parameters\\\": 2, \\\"formal\\\": 2, \\\"actual\\\": 3, \\\"pass\\\": 2, \\\"storage\\\": 7, \\\"automatic\\\": 1, \\\"auto\\\": 1, \\\"static\\\": 3, \\\"seed\\\": 3, \\\"number\\\": 3, \\\"random\\\": 3, \\\"mutator\\\": 3, \\\"methods\\\": 3, \\\"standard\\\": 3, \\\"stream\\\": 3, \\\"multiple\\\": 3, \\\"endoffile\\\": 3, \\\"signal\\\": 3, \\\"trailer\\\": 3, \\\"state\\\": 6, \\\"whitespace\\\": 3, \\\"flags\\\": 3, \\\"summation\\\": 3, \\\"notation\\\": 3}\", \"index_docs\": \"{\\\"208\\\": 1, \\\"5\\\": 51, \\\"22\\\": 14, \\\"95\\\": 3, \\\"162\\\": 2, \\\"209\\\": 1, \\\"2\\\": 163, \\\"210\\\": 1, \\\"163\\\": 2, \\\"164\\\": 2, \\\"212\\\": 1, \\\"211\\\": 1, \\\"67\\\": 4, \\\"1\\\": 176, \\\"4\\\": 90, \\\"58\\\": 5, \\\"17\\\": 20, \\\"97\\\": 3, \\\"14\\\": 23, \\\"11\\\": 28, \\\"96\\\": 3, \\\"213\\\": 1, \\\"10\\\": 30, \\\"3\\\": 105, \\\"214\\\": 1, \\\"68\\\": 4, \\\"69\\\": 4, \\\"9\\\": 28, \\\"20\\\": 13, \\\"33\\\": 8, \\\"8\\\": 34, \\\"13\\\": 26, \\\"215\\\": 1, \\\"216\\\": 1, \\\"218\\\": 1, \\\"217\\\": 1, \\\"219\\\": 1, \\\"220\\\": 1, \\\"221\\\": 1, \\\"222\\\": 1, \\\"223\\\": 1, \\\"29\\\": 9, \\\"70\\\": 4, \\\"224\\\": 1, \\\"225\\\": 1, \\\"98\\\": 3, \\\"30\\\": 9, \\\"15\\\": 22, \\\"71\\\": 4, \\\"34\\\": 8, \\\"165\\\": 2, \\\"6\\\": 44, \\\"47\\\": 6, \\\"25\\\": 12, \\\"226\\\": 1, \\\"227\\\": 1, \\\"99\\\": 3, \\\"24\\\": 13, \\\"166\\\": 2, \\\"167\\\": 2, \\\"169\\\": 2, \\\"170\\\": 2, \\\"168\\\": 2, \\\"35\\\": 8, \\\"229\\\": 1, \\\"228\\\": 1, \\\"31\\\": 9, \\\"41\\\": 7, \\\"100\\\": 3, \\\"72\\\": 4, \\\"73\\\": 4, \\\"171\\\": 2, \\\"101\\\": 3, \\\"172\\\": 2, \\\"74\\\": 4, \\\"23\\\": 14, \\\"75\\\": 4, \\\"59\\\": 5, \\\"16\\\": 21, \\\"230\\\": 1, \\\"231\\\": 1, \\\"18\\\": 17, \\\"173\\\": 2, \\\"232\\\": 1, \\\"7\\\": 41, \\\"174\\\": 2, \\\"12\\\": 26, \\\"233\\\": 1, \\\"27\\\": 10, \\\"234\\\": 1, \\\"76\\\": 4, \\\"60\\\": 5, \\\"235\\\": 1, \\\"102\\\": 3, \\\"61\\\": 5, \\\"236\\\": 1, \\\"175\\\": 2, \\\"103\\\": 3, \\\"176\\\": 2, \\\"32\\\": 9, \\\"36\\\": 8, \\\"77\\\": 4, \\\"237\\\": 1, \\\"42\\\": 7, \\\"238\\\": 1, \\\"78\\\": 4, \\\"177\\\": 2, \\\"43\\\": 7, \\\"239\\\": 1, \\\"79\\\": 4, \\\"240\\\": 1, \\\"241\\\": 1, \\\"44\\\": 7, \\\"242\\\": 1, \\\"48\\\": 6, \\\"178\\\": 2, \\\"179\\\": 2, \\\"243\\\": 1, \\\"244\\\": 1, \\\"245\\\": 1, \\\"45\\\": 7, \\\"19\\\": 17, \\\"80\\\": 4, \\\"37\\\": 8, \\\"104\\\": 3, \\\"81\\\": 4, \\\"38\\\": 8, \\\"105\\\": 3, \\\"246\\\": 1, \\\"247\\\": 1, \\\"248\\\": 1, \\\"249\\\": 1, \\\"180\\\": 2, \\\"181\\\": 2, \\\"82\\\": 4, \\\"62\\\": 5, \\\"182\\\": 2, \\\"183\\\": 2, \\\"83\\\": 4, \\\"84\\\": 4, \\\"184\\\": 2, \\\"185\\\": 2, \\\"186\\\": 2, \\\"63\\\": 5, \\\"250\\\": 1, \\\"251\\\": 1, \\\"85\\\": 4, \\\"187\\\": 2, \\\"252\\\": 1, \\\"253\\\": 1, \\\"86\\\": 4, \\\"188\\\": 2, \\\"189\\\": 2, \\\"87\\\": 4, \\\"89\\\": 4, \\\"39\\\": 8, \\\"88\\\": 4, \\\"254\\\": 1, \\\"190\\\": 2, \\\"255\\\": 1, \\\"257\\\": 1, \\\"256\\\": 1, \\\"106\\\": 3, \\\"258\\\": 1, \\\"64\\\": 5, \\\"259\\\": 1, \\\"108\\\": 3, \\\"107\\\": 3, \\\"109\\\": 3, \\\"110\\\": 3, \\\"111\\\": 3, \\\"90\\\": 4, \\\"46\\\": 7, \\\"21\\\": 14, \\\"261\\\": 1, \\\"260\\\": 1, \\\"26\\\": 11, \\\"191\\\": 2, \\\"192\\\": 2, \\\"91\\\": 4, \\\"92\\\": 4, \\\"112\\\": 3, \\\"262\\\": 1, \\\"65\\\": 4, \\\"264\\\": 1, \\\"263\\\": 1, \\\"113\\\": 3, \\\"93\\\": 4, \\\"193\\\": 2, \\\"114\\\": 3, \\\"49\\\": 6, \\\"265\\\": 1, \\\"266\\\": 1, \\\"50\\\": 6, \\\"115\\\": 3, \\\"116\\\": 3, \\\"117\\\": 3, \\\"118\\\": 3, \\\"119\\\": 3, \\\"120\\\": 3, \\\"121\\\": 3, \\\"122\\\": 3, \\\"123\\\": 3, \\\"124\\\": 3, \\\"126\\\": 3, \\\"125\\\": 3, \\\"127\\\": 3, \\\"51\\\": 6, \\\"128\\\": 3, \\\"52\\\": 6, \\\"129\\\": 3, \\\"130\\\": 3, \\\"131\\\": 3, \\\"132\\\": 3, \\\"133\\\": 3, \\\"134\\\": 3, \\\"267\\\": 1, \\\"135\\\": 3, \\\"136\\\": 3, \\\"53\\\": 6, \\\"137\\\": 3, \\\"138\\\": 3, \\\"139\\\": 3, \\\"28\\\": 7, \\\"66\\\": 4, \\\"194\\\": 2, \\\"268\\\": 1, \\\"195\\\": 2, \\\"140\\\": 3, \\\"196\\\": 2, \\\"54\\\": 6, \\\"197\\\": 2, \\\"198\\\": 2, \\\"269\\\": 1, \\\"199\\\": 2, \\\"270\\\": 1, \\\"55\\\": 6, \\\"271\\\": 1, \\\"141\\\": 3, \\\"272\\\": 1, \\\"142\\\": 3, \\\"200\\\": 2, \\\"201\\\": 2, \\\"273\\\": 1, \\\"202\\\": 2, \\\"203\\\": 2, \\\"56\\\": 6, \\\"204\\\": 2, \\\"143\\\": 3, \\\"94\\\": 4, \\\"144\\\": 3, \\\"274\\\": 1, \\\"206\\\": 2, \\\"205\\\": 2, \\\"145\\\": 3, \\\"207\\\": 2, \\\"40\\\": 7, \\\"275\\\": 1, \\\"276\\\": 1, \\\"146\\\": 3, \\\"149\\\": 3, \\\"148\\\": 3, \\\"147\\\": 3, \\\"150\\\": 3, \\\"151\\\": 3, \\\"152\\\": 3, \\\"153\\\": 3, \\\"154\\\": 3, \\\"155\\\": 3, \\\"157\\\": 3, \\\"156\\\": 3, \\\"57\\\": 6, \\\"158\\\": 3, \\\"159\\\": 3, \\\"160\\\": 3, \\\"161\\\": 3}\", \"index_word\": \"{\\\"1\\\": \\\"what\\\", \\\"2\\\": \\\"is\\\", \\\"3\\\": \\\"define\\\", \\\"4\\\": \\\"a\\\", \\\"5\\\": \\\"how\\\", \\\"6\\\": \\\"describe\\\", \\\"7\\\": \\\"array\\\", \\\"8\\\": \\\"an\\\", \\\"9\\\": \\\"the\\\", \\\"10\\\": \\\"function\\\", \\\"11\\\": \\\"of\\\", \\\"12\\\": \\\"to\\\", \\\"13\\\": \\\"error\\\", \\\"14\\\": \\\"does\\\", \\\"15\\\": \\\"in\\\", \\\"16\\\": \\\"loop\\\", \\\"17\\\": \\\"class\\\", \\\"18\\\": \\\"operator\\\", \\\"19\\\": \\\"string\\\", \\\"20\\\": \\\"do\\\", \\\"21\\\": \\\"statement\\\", \\\"22\\\": \\\"are\\\", \\\"23\\\": \\\"structure\\\", \\\"24\\\": \\\"data\\\", \\\"25\\\": \\\"file\\\", \\\"26\\\": \\\"work\\\", \\\"27\\\": \\\"for\\\", \\\"28\\\": \\\"while\\\", \\\"29\\\": \\\"c\\\", \\\"30\\\": \\\"classes\\\", \\\"31\\\": \\\"by\\\", \\\"32\\\": \\\"size\\\", \\\"33\\\": \\\"overflow\\\", \\\"34\\\": \\\"inheritance\\\", \\\"35\\\": \\\"explain\\\", \\\"36\\\": \\\"we\\\", \\\"37\\\": \\\"character\\\", \\\"38\\\": \\\"and\\\", \\\"39\\\": \\\"if\\\", \\\"40\\\": \\\"storage\\\", \\\"41\\\": \\\"meant\\\", \\\"42\\\": \\\"can\\\", \\\"43\\\": \\\"sort\\\", \\\"44\\\": \\\"search\\\", \\\"45\\\": \\\"cstyle\\\", \\\"46\\\": \\\"short\\\", \\\"47\\\": \\\"header\\\", \\\"48\\\": \\\"value\\\", \\\"49\\\": \\\"comment\\\", \\\"50\\\": \\\"directive\\\", \\\"51\\\": \\\"long\\\", \\\"52\\\": \\\"double\\\", \\\"53\\\": \\\"syntax\\\", \\\"54\\\": \\\"controlled\\\", \\\"55\\\": \\\"modularity\\\", \\\"56\\\": \\\"parameter\\\", \\\"57\\\": \\\"state\\\", \\\"58\\\": \\\"protected\\\", \\\"59\\\": \\\"selection\\\", \\\"60\\\": \\\"declaration\\\", \\\"61\\\": \\\"elements\\\", \\\"62\\\": \\\"library\\\", \\\"63\\\": \\\"strcat\\\", \\\"64\\\": \\\"logical\\\", \\\"65\\\": \\\"break\\\", \\\"66\\\": \\\"loops\\\", \\\"67\\\": \\\"member\\\", \\\"68\\\": \\\"this\\\", \\\"69\\\": \\\"pointer\\\", \\\"70\\\": \\\"compiler\\\", \\\"71\\\": \\\"functions\\\", \\\"72\\\": \\\"chart\\\", \\\"73\\\": \\\"purpose\\\", \\\"74\\\": \\\"sequence\\\", \\\"75\\\": \\\"conditional\\\", \\\"76\\\": \\\"method\\\", \\\"77\\\": \\\"constant\\\", \\\"78\\\": \\\"sorting\\\", \\\"79\\\": \\\"find\\\", \\\"80\\\": \\\"char\\\", \\\"81\\\": \\\"between\\\", \\\"82\\\": \\\"list\\\", \\\"83\\\": \\\"return\\\", \\\"84\\\": \\\"strcpy\\\", \\\"85\\\": \\\"strcmp\\\", \\\"86\\\": \\\"type\\\", \\\"87\\\": \\\"empty\\\", \\\"88\\\": \\\"or\\\", \\\"89\\\": \\\"not\\\", \\\"90\\\": \\\"circuiting\\\", \\\"91\\\": \\\"why\\\", \\\"92\\\": \\\"used\\\", \\\"93\\\": \\\"expression\\\", \\\"94\\\": \\\"scope\\\", \\\"95\\\": \\\"you\\\", \\\"96\\\": \\\"being\\\", \\\"97\\\": \\\"mean\\\", \\\"98\\\": \\\"polymorphism\\\", \\\"99\\\": \\\"types\\\", \\\"100\\\": \\\"flow\\\", \\\"101\\\": \\\"pseudocode\\\", \\\"102\\\": \\\"one\\\", \\\"103\\\": \\\"offset\\\", \\\"104\\\": \\\"difference\\\", \\\"105\\\": \\\"normal\\\", \\\"106\\\": \\\"cstr\\\", \\\"107\\\": \\\"logic\\\", \\\"108\\\": \\\"behind\\\", \\\"109\\\": \\\"true\\\", \\\"110\\\": \\\"truth\\\", \\\"111\\\": \\\"table\\\", \\\"112\\\": \\\"switch\\\", \\\"113\\\": \\\"overloading\\\", \\\"114\\\": \\\"test\\\", \\\"115\\\": \\\"preprocessor\\\", \\\"116\\\": \\\"include\\\", \\\"117\\\": \\\"iostream\\\", \\\"118\\\": \\\"cmath\\\", \\\"119\\\": \\\"namespace\\\", \\\"120\\\": \\\"using\\\", \\\"121\\\": \\\"code\\\", \\\"122\\\": \\\"block\\\", \\\"123\\\": \\\"main\\\", \\\"124\\\": \\\"variable\\\", \\\"125\\\": \\\"memory\\\", \\\"126\\\": \\\"snapshot\\\", \\\"127\\\": \\\"int\\\", \\\"128\\\": \\\"float\\\", \\\"129\\\": \\\"bool\\\", \\\"130\\\": \\\"boolean\\\", \\\"131\\\": \\\"implementation\\\", \\\"132\\\": \\\"truncated\\\", \\\"133\\\": \\\"result\\\", \\\"134\\\": \\\"underflow\\\", \\\"135\\\": \\\"cin\\\", \\\"136\\\": \\\"cout\\\", \\\"137\\\": \\\"parse\\\", \\\"138\\\": \\\"execution\\\", \\\"139\\\": \\\"runtime\\\", \\\"140\\\": \\\"continue\\\", \\\"141\\\": \\\"modules\\\", \\\"142\\\": \\\"abstraction\\\", \\\"143\\\": \\\"prototype\\\", \\\"144\\\": \\\"custom\\\", \\\"145\\\": \\\"actual\\\", \\\"146\\\": \\\"static\\\", \\\"147\\\": \\\"random\\\", \\\"148\\\": \\\"number\\\", \\\"149\\\": \\\"seed\\\", \\\"150\\\": \\\"mutator\\\", \\\"151\\\": \\\"methods\\\", \\\"152\\\": \\\"standard\\\", \\\"153\\\": \\\"stream\\\", \\\"154\\\": \\\"multiple\\\", \\\"155\\\": \\\"endoffile\\\", \\\"156\\\": \\\"trailer\\\", \\\"157\\\": \\\"signal\\\", \\\"158\\\": \\\"whitespace\\\", \\\"159\\\": \\\"flags\\\", \\\"160\\\": \\\"summation\\\", \\\"161\\\": \\\"notation\\\", \\\"162\\\": \\\"there\\\", \\\"163\\\": \\\"good\\\", \\\"164\\\": \\\"day\\\", \\\"165\\\": \\\"use\\\", \\\"166\\\": \\\"many\\\", \\\"167\\\": \\\"stored\\\", \\\"168\\\": \\\"top\\\", \\\"169\\\": \\\"down\\\", \\\"170\\\": \\\"design\\\", \\\"171\\\": \\\"flowchart\\\", \\\"172\\\": \\\"programming\\\", \\\"173\\\": \\\"relational\\\", \\\"174\\\": \\\"declare\\\", \\\"175\\\": \\\"offsets\\\", \\\"176\\\": \\\"arrays\\\", \\\"177\\\": \\\"algorithm\\\", \\\"178\\\": \\\"element\\\", \\\"179\\\": \\\"sequential\\\", \\\"180\\\": \\\"exceed\\\", \\\"181\\\": \\\"cstring\\\", \\\"182\\\": \\\"strlen\\\", \\\"183\\\": \\\"length\\\", \\\"184\\\": \\\"copy\\\", \\\"185\\\": \\\"strings\\\", \\\"186\\\": \\\"another\\\", \\\"187\\\": \\\"compare\\\", \\\"188\\\": \\\"add\\\", \\\"189\\\": \\\"get\\\", \\\"190\\\": \\\"substr\\\", \\\"191\\\": \\\"else\\\", \\\"192\\\": \\\"nested\\\", \\\"193\\\": \\\"controlling\\\", \\\"194\\\": \\\"modification\\\", \\\"195\\\": \\\"command\\\", \\\"196\\\": \\\"counter\\\", \\\"197\\\": \\\"sentinel\\\", \\\"198\\\": \\\"end\\\", \\\"199\\\": \\\"infinite\\\", \\\"200\\\": \\\"advantages\\\", \\\"201\\\": \\\"charts\\\", \\\"202\\\": \\\"driver\\\", \\\"203\\\": \\\"definition\\\", \\\"204\\\": \\\"body\\\", \\\"205\\\": \\\"formal\\\", \\\"206\\\": \\\"parameters\\\", \\\"207\\\": \\\"pass\\\", \\\"208\\\": \\\"hi\\\", \\\"209\\\": \\\"anyone\\\", \\\"210\\\": \\\"hello\\\", \\\"211\\\": \\\"what\\\\u00e2\\\\u20ac\\\\u2122s\\\", \\\"212\\\": \\\"up\\\", \\\"213\\\": \\\"entail\\\", \\\"214\\\": \\\"members\\\", \\\"215\\\": \\\"errors\\\", \\\"216\\\": \\\"cya\\\", \\\"217\\\": \\\"see\\\", \\\"218\\\": \\\"later\\\", \\\"219\\\": \\\"goodbye\\\", \\\"220\\\": \\\"i\\\", \\\"221\\\": \\\"am\\\", \\\"222\\\": \\\"leaving\\\", \\\"223\\\": \\\"have\\\", \\\"224\\\": \\\"visual\\\", \\\"225\\\": \\\"studio\\\", \\\"226\\\": \\\"h\\\", \\\"227\\\": \\\"files\\\", \\\"228\\\": \\\"stepwise\\\", \\\"229\\\": \\\"refinement\\\", \\\"230\\\": \\\"repetition\\\", \\\"231\\\": \\\"iteration\\\", \\\"232\\\": \\\"operators\\\", \\\"233\\\": \\\"initialize\\\", \\\"234\\\": \\\"me\\\", \\\"235\\\": \\\"dimensional\\\", \\\"236\\\": \\\"made\\\", \\\"237\\\": \\\"maximum\\\", \\\"238\\\": \\\"be\\\", \\\"239\\\": \\\"vector\\\", \\\"240\\\": \\\"ascending\\\", \\\"241\\\": \\\"descending\\\", \\\"242\\\": \\\"algorithms\\\", \\\"243\\\": \\\"binary\\\", \\\"244\\\": \\\"ordered\\\", \\\"245\\\": \\\"faster\\\", \\\"246\\\": \\\"differentiate\\\", \\\"247\\\": \\\"assign\\\", \\\"248\\\": \\\"more\\\", \\\"249\\\": \\\"than\\\", \\\"250\\\": \\\"join\\\", \\\"251\\\": \\\"concatenate\\\", \\\"252\\\": \\\"ascii\\\", \\\"253\\\": \\\"values\\\", \\\"254\\\": \\\"know\\\", \\\"255\\\": \\\"edit\\\", \\\"256\\\": \\\"specific\\\", \\\"257\\\": \\\"part\\\", \\\"258\\\": \\\"filename\\\", \\\"259\\\": \\\"operation\\\", \\\"260\\\": \\\"stand\\\", \\\"261\\\": \\\"alone\\\", \\\"262\\\": \\\"fuction\\\", \\\"263\\\": \\\"inside\\\", \\\"264\\\": \\\"case\\\", \\\"265\\\": \\\"write\\\", \\\"266\\\": \\\"application\\\", \\\"267\\\": \\\"undeflow\\\", \\\"268\\\": \\\"update\\\", \\\"269\\\": \\\"kind\\\", \\\"270\\\": \\\"terminate\\\", \\\"271\\\": \\\"required\\\", \\\"272\\\": \\\"needed\\\", \\\"273\\\": \\\"drivers\\\", \\\"274\\\": \\\"fine\\\", \\\"275\\\": \\\"automatic\\\", \\\"276\\\": \\\"auto\\\"}\", \"word_index\": \"{\\\"what\\\": 1, \\\"is\\\": 2, \\\"define\\\": 3, \\\"a\\\": 4, \\\"how\\\": 5, \\\"describe\\\": 6, \\\"array\\\": 7, \\\"an\\\": 8, \\\"the\\\": 9, \\\"function\\\": 10, \\\"of\\\": 11, \\\"to\\\": 12, \\\"error\\\": 13, \\\"does\\\": 14, \\\"in\\\": 15, \\\"loop\\\": 16, \\\"class\\\": 17, \\\"operator\\\": 18, \\\"string\\\": 19, \\\"do\\\": 20, \\\"statement\\\": 21, \\\"are\\\": 22, \\\"structure\\\": 23, \\\"data\\\": 24, \\\"file\\\": 25, \\\"work\\\": 26, \\\"for\\\": 27, \\\"while\\\": 28, \\\"c\\\": 29, \\\"classes\\\": 30, \\\"by\\\": 31, \\\"size\\\": 32, \\\"overflow\\\": 33, \\\"inheritance\\\": 34, \\\"explain\\\": 35, \\\"we\\\": 36, \\\"character\\\": 37, \\\"and\\\": 38, \\\"if\\\": 39, \\\"storage\\\": 40, \\\"meant\\\": 41, \\\"can\\\": 42, \\\"sort\\\": 43, \\\"search\\\": 44, \\\"cstyle\\\": 45, \\\"short\\\": 46, \\\"header\\\": 47, \\\"value\\\": 48, \\\"comment\\\": 49, \\\"directive\\\": 50, \\\"long\\\": 51, \\\"double\\\": 52, \\\"syntax\\\": 53, \\\"controlled\\\": 54, \\\"modularity\\\": 55, \\\"parameter\\\": 56, \\\"state\\\": 57, \\\"protected\\\": 58, \\\"selection\\\": 59, \\\"declaration\\\": 60, \\\"elements\\\": 61, \\\"library\\\": 62, \\\"strcat\\\": 63, \\\"logical\\\": 64, \\\"break\\\": 65, \\\"loops\\\": 66, \\\"member\\\": 67, \\\"this\\\": 68, \\\"pointer\\\": 69, \\\"compiler\\\": 70, \\\"functions\\\": 71, \\\"chart\\\": 72, \\\"purpose\\\": 73, \\\"sequence\\\": 74, \\\"conditional\\\": 75, \\\"method\\\": 76, \\\"constant\\\": 77, \\\"sorting\\\": 78, \\\"find\\\": 79, \\\"char\\\": 80, \\\"between\\\": 81, \\\"list\\\": 82, \\\"return\\\": 83, \\\"strcpy\\\": 84, \\\"strcmp\\\": 85, \\\"type\\\": 86, \\\"empty\\\": 87, \\\"or\\\": 88, \\\"not\\\": 89, \\\"circuiting\\\": 90, \\\"why\\\": 91, \\\"used\\\": 92, \\\"expression\\\": 93, \\\"scope\\\": 94, \\\"you\\\": 95, \\\"being\\\": 96, \\\"mean\\\": 97, \\\"polymorphism\\\": 98, \\\"types\\\": 99, \\\"flow\\\": 100, \\\"pseudocode\\\": 101, \\\"one\\\": 102, \\\"offset\\\": 103, \\\"difference\\\": 104, \\\"normal\\\": 105, \\\"cstr\\\": 106, \\\"logic\\\": 107, \\\"behind\\\": 108, \\\"true\\\": 109, \\\"truth\\\": 110, \\\"table\\\": 111, \\\"switch\\\": 112, \\\"overloading\\\": 113, \\\"test\\\": 114, \\\"preprocessor\\\": 115, \\\"include\\\": 116, \\\"iostream\\\": 117, \\\"cmath\\\": 118, \\\"namespace\\\": 119, \\\"using\\\": 120, \\\"code\\\": 121, \\\"block\\\": 122, \\\"main\\\": 123, \\\"variable\\\": 124, \\\"memory\\\": 125, \\\"snapshot\\\": 126, \\\"int\\\": 127, \\\"float\\\": 128, \\\"bool\\\": 129, \\\"boolean\\\": 130, \\\"implementation\\\": 131, \\\"truncated\\\": 132, \\\"result\\\": 133, \\\"underflow\\\": 134, \\\"cin\\\": 135, \\\"cout\\\": 136, \\\"parse\\\": 137, \\\"execution\\\": 138, \\\"runtime\\\": 139, \\\"continue\\\": 140, \\\"modules\\\": 141, \\\"abstraction\\\": 142, \\\"prototype\\\": 143, \\\"custom\\\": 144, \\\"actual\\\": 145, \\\"static\\\": 146, \\\"random\\\": 147, \\\"number\\\": 148, \\\"seed\\\": 149, \\\"mutator\\\": 150, \\\"methods\\\": 151, \\\"standard\\\": 152, \\\"stream\\\": 153, \\\"multiple\\\": 154, \\\"endoffile\\\": 155, \\\"trailer\\\": 156, \\\"signal\\\": 157, \\\"whitespace\\\": 158, \\\"flags\\\": 159, \\\"summation\\\": 160, \\\"notation\\\": 161, \\\"there\\\": 162, \\\"good\\\": 163, \\\"day\\\": 164, \\\"use\\\": 165, \\\"many\\\": 166, \\\"stored\\\": 167, \\\"top\\\": 168, \\\"down\\\": 169, \\\"design\\\": 170, \\\"flowchart\\\": 171, \\\"programming\\\": 172, \\\"relational\\\": 173, \\\"declare\\\": 174, \\\"offsets\\\": 175, \\\"arrays\\\": 176, \\\"algorithm\\\": 177, \\\"element\\\": 178, \\\"sequential\\\": 179, \\\"exceed\\\": 180, \\\"cstring\\\": 181, \\\"strlen\\\": 182, \\\"length\\\": 183, \\\"copy\\\": 184, \\\"strings\\\": 185, \\\"another\\\": 186, \\\"compare\\\": 187, \\\"add\\\": 188, \\\"get\\\": 189, \\\"substr\\\": 190, \\\"else\\\": 191, \\\"nested\\\": 192, \\\"controlling\\\": 193, \\\"modification\\\": 194, \\\"command\\\": 195, \\\"counter\\\": 196, \\\"sentinel\\\": 197, \\\"end\\\": 198, \\\"infinite\\\": 199, \\\"advantages\\\": 200, \\\"charts\\\": 201, \\\"driver\\\": 202, \\\"definition\\\": 203, \\\"body\\\": 204, \\\"formal\\\": 205, \\\"parameters\\\": 206, \\\"pass\\\": 207, \\\"hi\\\": 208, \\\"anyone\\\": 209, \\\"hello\\\": 210, \\\"what\\\\u00e2\\\\u20ac\\\\u2122s\\\": 211, \\\"up\\\": 212, \\\"entail\\\": 213, \\\"members\\\": 214, \\\"errors\\\": 215, \\\"cya\\\": 216, \\\"see\\\": 217, \\\"later\\\": 218, \\\"goodbye\\\": 219, \\\"i\\\": 220, \\\"am\\\": 221, \\\"leaving\\\": 222, \\\"have\\\": 223, \\\"visual\\\": 224, \\\"studio\\\": 225, \\\"h\\\": 226, \\\"files\\\": 227, \\\"stepwise\\\": 228, \\\"refinement\\\": 229, \\\"repetition\\\": 230, \\\"iteration\\\": 231, \\\"operators\\\": 232, \\\"initialize\\\": 233, \\\"me\\\": 234, \\\"dimensional\\\": 235, \\\"made\\\": 236, \\\"maximum\\\": 237, \\\"be\\\": 238, \\\"vector\\\": 239, \\\"ascending\\\": 240, \\\"descending\\\": 241, \\\"algorithms\\\": 242, \\\"binary\\\": 243, \\\"ordered\\\": 244, \\\"faster\\\": 245, \\\"differentiate\\\": 246, \\\"assign\\\": 247, \\\"more\\\": 248, \\\"than\\\": 249, \\\"join\\\": 250, \\\"concatenate\\\": 251, \\\"ascii\\\": 252, \\\"values\\\": 253, \\\"know\\\": 254, \\\"edit\\\": 255, \\\"specific\\\": 256, \\\"part\\\": 257, \\\"filename\\\": 258, \\\"operation\\\": 259, \\\"stand\\\": 260, \\\"alone\\\": 261, \\\"fuction\\\": 262, \\\"inside\\\": 263, \\\"case\\\": 264, \\\"write\\\": 265, \\\"application\\\": 266, \\\"undeflow\\\": 267, \\\"update\\\": 268, \\\"kind\\\": 269, \\\"terminate\\\": 270, \\\"required\\\": 271, \\\"needed\\\": 272, \\\"drivers\\\": 273, \\\"fine\\\": 274, \\\"automatic\\\": 275, \\\"auto\\\": 276}\"}}"