"{\"class_name\": \"Tokenizer\", \"config\": {\"num_words\": 292, \"filters\": \"!\\\"#$%&()*+,-./:;<=>?@[\\\\]^_`{|}~\\t\\n\", \"lower\": true, \"split\": \" \", \"char_level\": false, \"oov_token\": \"UNK\", \"document_count\": 449, \"word_counts\": \"{\\\"hi\\\": 1, \\\"how\\\": 51, \\\"are\\\": 14, \\\"you\\\": 3, \\\"is\\\": 163, \\\"anyone\\\": 1, \\\"there\\\": 2, \\\"hello\\\": 1, \\\"good\\\": 2, \\\"day\\\": 2, \\\"whats\\\": 1, \\\"up\\\": 1, \\\"what\\\": 177, \\\"a\\\": 94, \\\"protected\\\": 5, \\\"member\\\": 5, \\\"doe\\\": 24, \\\"being\\\": 3, \\\"of\\\": 28, \\\"class\\\": 29, \\\"mean\\\": 3, \\\"entail\\\": 1, \\\"function\\\": 34, \\\"define\\\": 105, \\\"the\\\": 32, \\\"this\\\": 4, \\\"pointer\\\": 4, \\\"do\\\": 16, \\\"an\\\": 36, \\\"overflow\\\": 8, \\\"error\\\": 27, \\\"cya\\\": 1, \\\"see\\\": 1, \\\"later\\\": 1, \\\"goodbye\\\": 1, \\\"i\\\": 1, \\\"am\\\": 1, \\\"leaving\\\": 1, \\\"have\\\": 1, \\\"c\\\": 9, \\\"compiler\\\": 4, \\\"visual\\\": 1, \\\"studio\\\": 1, \\\"polymorphism\\\": 3, \\\"in\\\": 23, \\\"inheritance\\\": 8, \\\"use\\\": 2, \\\"describe\\\": 44, \\\"header\\\": 6, \\\"file\\\": 13, \\\"h\\\": 1, \\\"data\\\": 13, \\\"type\\\": 7, \\\"many\\\": 2, \\\"stored\\\": 2, \\\"top\\\": 2, \\\"down\\\": 2, \\\"design\\\": 2, \\\"explain\\\": 8, \\\"stepwise\\\": 1, \\\"refinement\\\": 1, \\\"meant\\\": 7, \\\"by\\\": 9, \\\"flow\\\": 3, \\\"chart\\\": 6, \\\"purpose\\\": 4, \\\"flowchart\\\": 2, \\\"pseudocode\\\": 3, \\\"sequence\\\": 4, \\\"structure\\\": 14, \\\"programming\\\": 2, \\\"conditional\\\": 4, \\\"selection\\\": 5, \\\"loop\\\": 27, \\\"repetition\\\": 1, \\\"iteration\\\": 1, \\\"relational\\\": 2, \\\"operator\\\": 18, \\\"to\\\": 28, \\\"declare\\\": 2, \\\"array\\\": 44, \\\"initialize\\\": 1, \\\"method\\\": 7, \\\"for\\\": 10, \\\"me\\\": 1, \\\"declaration\\\": 5, \\\"one\\\": 3, \\\"dimensional\\\": 1, \\\"element\\\": 7, \\\"made\\\": 1, \\\"offset\\\": 5, \\\"size\\\": 9, \\\"we\\\": 8, \\\"constant\\\": 4, \\\"maximum\\\": 1, \\\"can\\\": 7, \\\"be\\\": 1, \\\"sorting\\\": 4, \\\"algorithm\\\": 3, \\\"sort\\\": 7, \\\"vector\\\": 1, \\\"find\\\": 4, \\\"ascending\\\": 1, \\\"descending\\\": 1, \\\"search\\\": 7, \\\"value\\\": 7, \\\"sequential\\\": 2, \\\"binary\\\": 1, \\\"ordered\\\": 1, \\\"faster\\\": 1, \\\"cstyle\\\": 7, \\\"string\\\": 19, \\\"char\\\": 4, \\\"character\\\": 8, \\\"difference\\\": 3, \\\"between\\\": 4, \\\"and\\\": 8, \\\"normal\\\": 3, \\\"differentiate\\\": 1, \\\"assign\\\": 1, \\\"more\\\": 1, \\\"than\\\": 1, \\\"exceed\\\": 2, \\\"cstring\\\": 2, \\\"list\\\": 4, \\\"library\\\": 5, \\\"strlen\\\": 2, \\\"length\\\": 2, \\\"return\\\": 4, \\\"strcpy\\\": 4, \\\"copy\\\": 2, \\\"another\\\": 2, \\\"strcat\\\": 5, \\\"join\\\": 1, \\\"concatenate\\\": 1, \\\"strcmp\\\": 4, \\\"compare\\\": 2, \\\"ascii\\\": 1, \\\"add\\\": 2, \\\"get\\\": 2, \\\"empty\\\": 4, \\\"know\\\": 1, \\\"if\\\": 8, \\\"or\\\": 4, \\\"not\\\": 4, \\\"substr\\\": 2, \\\"edit\\\": 1, \\\"specific\\\": 1, \\\"part\\\": 1, \\\"cstr\\\": 3, \\\"filename\\\": 1, \\\"logical\\\": 5, \\\"operation\\\": 1, \\\"logic\\\": 3, \\\"behind\\\": 3, \\\"true\\\": 3, \\\"truth\\\": 3, \\\"table\\\": 3, \\\"short\\\": 7, \\\"circuiting\\\": 4, \\\"statement\\\": 15, \\\"stand\\\": 1, \\\"alone\\\": 1, \\\"work\\\": 11, \\\"else\\\": 2, \\\"nested\\\": 2, \\\"why\\\": 4, \\\"used\\\": 4, \\\"switch\\\": 3, \\\"fuction\\\": 1, \\\"break\\\": 5, \\\"inside\\\": 1, \\\"case\\\": 1, \\\"overloading\\\": 3, \\\"controlling\\\": 2, \\\"expression\\\": 4, \\\"test\\\": 3, \\\"comment\\\": 6, \\\"write\\\": 1, \\\"application\\\": 1, \\\"preprocessor\\\": 3, \\\"directive\\\": 6, \\\"include\\\": 3, \\\"iostream\\\": 3, \\\"cmath\\\": 3, \\\"namespace\\\": 3, \\\"using\\\": 3, \\\"code\\\": 3, \\\"block\\\": 3, \\\"main\\\": 3, \\\"variable\\\": 3, \\\"memory\\\": 3, \\\"snapshot\\\": 3, \\\"int\\\": 3, \\\"long\\\": 6, \\\"float\\\": 3, \\\"double\\\": 6, \\\"bool\\\": 3, \\\"boolean\\\": 3, \\\"implementation\\\": 3, \\\"truncated\\\": 3, \\\"result\\\": 3, \\\"underflow\\\": 3, \\\"undeflow\\\": 1, \\\"cin\\\": 3, \\\"cout\\\": 3, \\\"syntax\\\": 6, \\\"parse\\\": 3, \\\"execution\\\": 3, \\\"runtime\\\": 3, \\\"while\\\": 10, \\\"modification\\\": 2, \\\"update\\\": 1, \\\"command\\\": 2, \\\"continue\\\": 3, \\\"counter\\\": 2, \\\"controlled\\\": 6, \\\"sentinel\\\": 2, \\\"end\\\": 2, \\\"kind\\\": 1, \\\"infinite\\\": 2, \\\"terminate\\\": 1, \\\"modularity\\\": 6, \\\"module\\\": 3, \\\"required\\\": 1, \\\"needed\\\": 1, \\\"abstraction\\\": 3, \\\"advantage\\\": 2, \\\"driver\\\": 3, \\\"definition\\\": 2, \\\"parameter\\\": 8, \\\"body\\\": 2, \\\"prototype\\\": 3, \\\"scope\\\": 4, \\\"custom\\\": 3, \\\"fine\\\": 1, \\\"formal\\\": 2, \\\"actual\\\": 3, \\\"pas\\\": 2, \\\"storage\\\": 8, \\\"automatic\\\": 1, \\\"auto\\\": 1, \\\"static\\\": 3, \\\"random\\\": 3, \\\"number\\\": 3, \\\"seed\\\": 3, \\\"mutator\\\": 3, \\\"standard\\\": 3, \\\"stream\\\": 3, \\\"multiple\\\": 3, \\\"endoffile\\\": 3, \\\"trailer\\\": 3, \\\"signal\\\": 3, \\\"state\\\": 6, \\\"whitespace\\\": 3, \\\"flag\\\": 3, \\\"summation\\\": 3, \\\"notation\\\": 3}\", \"word_docs\": \"{\\\"hi\\\": 1, \\\"how\\\": 51, \\\"you\\\": 3, \\\"are\\\": 14, \\\"there\\\": 2, \\\"anyone\\\": 1, \\\"is\\\": 163, \\\"hello\\\": 1, \\\"day\\\": 2, \\\"good\\\": 2, \\\"up\\\": 1, \\\"whats\\\": 1, \\\"protected\\\": 5, \\\"what\\\": 176, \\\"member\\\": 5, \\\"a\\\": 90, \\\"doe\\\": 23, \\\"mean\\\": 3, \\\"class\\\": 29, \\\"of\\\": 28, \\\"being\\\": 3, \\\"entail\\\": 1, \\\"function\\\": 34, \\\"define\\\": 105, \\\"this\\\": 4, \\\"the\\\": 28, \\\"pointer\\\": 4, \\\"do\\\": 13, \\\"error\\\": 27, \\\"an\\\": 34, \\\"overflow\\\": 8, \\\"cya\\\": 1, \\\"later\\\": 1, \\\"see\\\": 1, \\\"goodbye\\\": 1, \\\"i\\\": 1, \\\"leaving\\\": 1, \\\"am\\\": 1, \\\"have\\\": 1, \\\"c\\\": 9, \\\"compiler\\\": 4, \\\"studio\\\": 1, \\\"visual\\\": 1, \\\"polymorphism\\\": 3, \\\"in\\\": 22, \\\"inheritance\\\": 8, \\\"use\\\": 2, \\\"describe\\\": 44, \\\"file\\\": 13, \\\"header\\\": 6, \\\"h\\\": 1, \\\"data\\\": 13, \\\"type\\\": 7, \\\"many\\\": 2, \\\"stored\\\": 2, \\\"top\\\": 2, \\\"design\\\": 2, \\\"down\\\": 2, \\\"explain\\\": 8, \\\"refinement\\\": 1, \\\"stepwise\\\": 1, \\\"by\\\": 9, \\\"meant\\\": 7, \\\"chart\\\": 6, \\\"flow\\\": 3, \\\"purpose\\\": 4, \\\"flowchart\\\": 2, \\\"pseudocode\\\": 3, \\\"programming\\\": 2, \\\"sequence\\\": 4, \\\"structure\\\": 14, \\\"conditional\\\": 4, \\\"selection\\\": 5, \\\"loop\\\": 25, \\\"repetition\\\": 1, \\\"iteration\\\": 1, \\\"relational\\\": 2, \\\"operator\\\": 18, \\\"array\\\": 43, \\\"declare\\\": 2, \\\"to\\\": 26, \\\"initialize\\\": 1, \\\"method\\\": 7, \\\"for\\\": 10, \\\"me\\\": 1, \\\"declaration\\\": 5, \\\"dimensional\\\": 1, \\\"one\\\": 3, \\\"element\\\": 7, \\\"made\\\": 1, \\\"offset\\\": 5, \\\"size\\\": 9, \\\"we\\\": 8, \\\"constant\\\": 4, \\\"maximum\\\": 1, \\\"be\\\": 1, \\\"can\\\": 7, \\\"sorting\\\": 4, \\\"algorithm\\\": 3, \\\"sort\\\": 7, \\\"vector\\\": 1, \\\"find\\\": 4, \\\"ascending\\\": 1, \\\"descending\\\": 1, \\\"search\\\": 7, \\\"value\\\": 7, \\\"sequential\\\": 2, \\\"binary\\\": 1, \\\"ordered\\\": 1, \\\"faster\\\": 1, \\\"string\\\": 19, \\\"cstyle\\\": 7, \\\"char\\\": 4, \\\"character\\\": 8, \\\"between\\\": 4, \\\"difference\\\": 3, \\\"normal\\\": 3, \\\"and\\\": 8, \\\"differentiate\\\": 1, \\\"assign\\\": 1, \\\"than\\\": 1, \\\"more\\\": 1, \\\"exceed\\\": 2, \\\"cstring\\\": 2, \\\"list\\\": 4, \\\"library\\\": 5, \\\"strlen\\\": 2, \\\"length\\\": 2, \\\"return\\\": 4, \\\"strcpy\\\": 4, \\\"copy\\\": 2, \\\"another\\\": 2, \\\"strcat\\\": 5, \\\"join\\\": 1, \\\"concatenate\\\": 1, \\\"strcmp\\\": 4, \\\"compare\\\": 2, \\\"ascii\\\": 1, \\\"add\\\": 2, \\\"get\\\": 2, \\\"empty\\\": 4, \\\"if\\\": 8, \\\"know\\\": 1, \\\"or\\\": 4, \\\"not\\\": 4, \\\"substr\\\": 2, \\\"edit\\\": 1, \\\"specific\\\": 1, \\\"part\\\": 1, \\\"cstr\\\": 3, \\\"filename\\\": 1, \\\"logical\\\": 5, \\\"operation\\\": 1, \\\"logic\\\": 3, \\\"behind\\\": 3, \\\"true\\\": 3, \\\"table\\\": 3, \\\"truth\\\": 3, \\\"circuiting\\\": 4, \\\"short\\\": 7, \\\"statement\\\": 14, \\\"stand\\\": 1, \\\"work\\\": 11, \\\"alone\\\": 1, \\\"else\\\": 2, \\\"nested\\\": 2, \\\"used\\\": 4, \\\"why\\\": 4, \\\"switch\\\": 3, \\\"fuction\\\": 1, \\\"break\\\": 4, \\\"inside\\\": 1, \\\"case\\\": 1, \\\"overloading\\\": 3, \\\"expression\\\": 4, \\\"controlling\\\": 2, \\\"test\\\": 3, \\\"comment\\\": 6, \\\"write\\\": 1, \\\"application\\\": 1, \\\"preprocessor\\\": 3, \\\"directive\\\": 6, \\\"include\\\": 3, \\\"iostream\\\": 3, \\\"cmath\\\": 3, \\\"namespace\\\": 3, \\\"using\\\": 3, \\\"code\\\": 3, \\\"block\\\": 3, \\\"main\\\": 3, \\\"variable\\\": 3, \\\"memory\\\": 3, \\\"snapshot\\\": 3, \\\"int\\\": 3, \\\"long\\\": 6, \\\"float\\\": 3, \\\"double\\\": 6, \\\"bool\\\": 3, \\\"boolean\\\": 3, \\\"implementation\\\": 3, \\\"result\\\": 3, \\\"truncated\\\": 3, \\\"underflow\\\": 3, \\\"undeflow\\\": 1, \\\"cin\\\": 3, \\\"cout\\\": 3, \\\"syntax\\\": 6, \\\"parse\\\": 3, \\\"execution\\\": 3, \\\"runtime\\\": 3, \\\"while\\\": 7, \\\"modification\\\": 2, \\\"update\\\": 1, \\\"command\\\": 2, \\\"continue\\\": 3, \\\"controlled\\\": 6, \\\"counter\\\": 2, \\\"sentinel\\\": 2, \\\"end\\\": 2, \\\"kind\\\": 1, \\\"infinite\\\": 2, \\\"terminate\\\": 1, \\\"modularity\\\": 6, \\\"required\\\": 1, \\\"module\\\": 3, \\\"needed\\\": 1, \\\"abstraction\\\": 3, \\\"advantage\\\": 2, \\\"driver\\\": 3, \\\"definition\\\": 2, \\\"parameter\\\": 8, \\\"body\\\": 2, \\\"prototype\\\": 3, \\\"scope\\\": 4, \\\"custom\\\": 3, \\\"fine\\\": 1, \\\"formal\\\": 2, \\\"actual\\\": 3, \\\"pas\\\": 2, \\\"storage\\\": 7, \\\"automatic\\\": 1, \\\"auto\\\": 1, \\\"static\\\": 3, \\\"seed\\\": 3, \\\"random\\\": 3, \\\"number\\\": 3, \\\"mutator\\\": 3, \\\"standard\\\": 3, \\\"stream\\\": 3, \\\"multiple\\\": 3, \\\"endoffile\\\": 3, \\\"trailer\\\": 3, \\\"signal\\\": 3, \\\"state\\\": 6, \\\"whitespace\\\": 3, \\\"flag\\\": 3, \\\"notation\\\": 3, \\\"summation\\\": 3}\", \"index_docs\": \"{\\\"198\\\": 1, \\\"6\\\": 51, \\\"94\\\": 3, \\\"23\\\": 14, \\\"160\\\": 2, \\\"199\\\": 1, \\\"3\\\": 163, \\\"200\\\": 1, \\\"162\\\": 2, \\\"161\\\": 2, \\\"202\\\": 1, \\\"201\\\": 1, \\\"62\\\": 5, \\\"2\\\": 176, \\\"63\\\": 5, \\\"5\\\": 90, \\\"17\\\": 23, \\\"96\\\": 3, \\\"12\\\": 29, \\\"13\\\": 28, \\\"95\\\": 3, \\\"203\\\": 1, \\\"10\\\": 34, \\\"4\\\": 105, \\\"71\\\": 4, \\\"11\\\": 28, \\\"72\\\": 4, \\\"21\\\": 13, \\\"15\\\": 27, \\\"9\\\": 34, \\\"33\\\": 8, \\\"204\\\": 1, \\\"206\\\": 1, \\\"205\\\": 1, \\\"207\\\": 1, \\\"208\\\": 1, \\\"210\\\": 1, \\\"209\\\": 1, \\\"211\\\": 1, \\\"30\\\": 9, \\\"73\\\": 4, \\\"213\\\": 1, \\\"212\\\": 1, \\\"97\\\": 3, \\\"18\\\": 22, \\\"34\\\": 8, \\\"163\\\": 2, \\\"7\\\": 44, \\\"25\\\": 13, \\\"52\\\": 6, \\\"214\\\": 1, \\\"26\\\": 13, \\\"42\\\": 7, \\\"164\\\": 2, \\\"165\\\": 2, \\\"166\\\": 2, \\\"168\\\": 2, \\\"167\\\": 2, \\\"35\\\": 8, \\\"216\\\": 1, \\\"215\\\": 1, \\\"31\\\": 9, \\\"43\\\": 7, \\\"53\\\": 6, \\\"98\\\": 3, \\\"74\\\": 4, \\\"169\\\": 2, \\\"99\\\": 3, \\\"170\\\": 2, \\\"75\\\": 4, \\\"24\\\": 14, \\\"76\\\": 4, \\\"64\\\": 5, \\\"16\\\": 25, \\\"217\\\": 1, \\\"218\\\": 1, \\\"171\\\": 2, \\\"20\\\": 18, \\\"8\\\": 43, \\\"172\\\": 2, \\\"14\\\": 26, \\\"219\\\": 1, \\\"44\\\": 7, \\\"28\\\": 10, \\\"220\\\": 1, \\\"65\\\": 5, \\\"221\\\": 1, \\\"100\\\": 3, \\\"45\\\": 7, \\\"222\\\": 1, \\\"66\\\": 5, \\\"32\\\": 9, \\\"36\\\": 8, \\\"77\\\": 4, \\\"223\\\": 1, \\\"224\\\": 1, \\\"46\\\": 7, \\\"78\\\": 4, \\\"101\\\": 3, \\\"47\\\": 7, \\\"225\\\": 1, \\\"79\\\": 4, \\\"226\\\": 1, \\\"227\\\": 1, \\\"48\\\": 7, \\\"49\\\": 7, \\\"173\\\": 2, \\\"228\\\": 1, \\\"229\\\": 1, \\\"230\\\": 1, \\\"19\\\": 19, \\\"50\\\": 7, \\\"80\\\": 4, \\\"37\\\": 8, \\\"81\\\": 4, \\\"102\\\": 3, \\\"103\\\": 3, \\\"38\\\": 8, \\\"231\\\": 1, \\\"232\\\": 1, \\\"234\\\": 1, \\\"233\\\": 1, \\\"174\\\": 2, \\\"175\\\": 2, \\\"82\\\": 4, \\\"67\\\": 5, \\\"176\\\": 2, \\\"177\\\": 2, \\\"83\\\": 4, \\\"84\\\": 4, \\\"178\\\": 2, \\\"179\\\": 2, \\\"68\\\": 5, \\\"235\\\": 1, \\\"236\\\": 1, \\\"85\\\": 4, \\\"180\\\": 2, \\\"237\\\": 1, \\\"181\\\": 2, \\\"182\\\": 2, \\\"86\\\": 4, \\\"39\\\": 8, \\\"238\\\": 1, \\\"87\\\": 4, \\\"88\\\": 4, \\\"183\\\": 2, \\\"239\\\": 1, \\\"240\\\": 1, \\\"241\\\": 1, \\\"104\\\": 3, \\\"242\\\": 1, \\\"69\\\": 5, \\\"243\\\": 1, \\\"105\\\": 3, \\\"106\\\": 3, \\\"107\\\": 3, \\\"109\\\": 3, \\\"108\\\": 3, \\\"89\\\": 4, \\\"51\\\": 7, \\\"22\\\": 14, \\\"244\\\": 1, \\\"27\\\": 11, \\\"245\\\": 1, \\\"184\\\": 2, \\\"185\\\": 2, \\\"91\\\": 4, \\\"90\\\": 4, \\\"110\\\": 3, \\\"246\\\": 1, \\\"70\\\": 4, \\\"247\\\": 1, \\\"248\\\": 1, \\\"111\\\": 3, \\\"92\\\": 4, \\\"186\\\": 2, \\\"112\\\": 3, \\\"54\\\": 6, \\\"249\\\": 1, \\\"250\\\": 1, \\\"113\\\": 3, \\\"55\\\": 6, \\\"114\\\": 3, \\\"115\\\": 3, \\\"116\\\": 3, \\\"117\\\": 3, \\\"118\\\": 3, \\\"119\\\": 3, \\\"120\\\": 3, \\\"121\\\": 3, \\\"122\\\": 3, \\\"123\\\": 3, \\\"124\\\": 3, \\\"125\\\": 3, \\\"56\\\": 6, \\\"126\\\": 3, \\\"57\\\": 6, \\\"127\\\": 3, \\\"128\\\": 3, \\\"129\\\": 3, \\\"131\\\": 3, \\\"130\\\": 3, \\\"132\\\": 3, \\\"251\\\": 1, \\\"133\\\": 3, \\\"134\\\": 3, \\\"58\\\": 6, \\\"135\\\": 3, \\\"136\\\": 3, \\\"137\\\": 3, \\\"29\\\": 7, \\\"187\\\": 2, \\\"252\\\": 1, \\\"188\\\": 2, \\\"138\\\": 3, \\\"59\\\": 6, \\\"189\\\": 2, \\\"190\\\": 2, \\\"191\\\": 2, \\\"253\\\": 1, \\\"192\\\": 2, \\\"254\\\": 1, \\\"60\\\": 6, \\\"255\\\": 1, \\\"139\\\": 3, \\\"256\\\": 1, \\\"140\\\": 3, \\\"193\\\": 2, \\\"141\\\": 3, \\\"194\\\": 2, \\\"40\\\": 8, \\\"195\\\": 2, \\\"142\\\": 3, \\\"93\\\": 4, \\\"143\\\": 3, \\\"257\\\": 1, \\\"196\\\": 2, \\\"144\\\": 3, \\\"197\\\": 2, \\\"41\\\": 7, \\\"258\\\": 1, \\\"259\\\": 1, \\\"145\\\": 3, \\\"148\\\": 3, \\\"146\\\": 3, \\\"147\\\": 3, \\\"149\\\": 3, \\\"150\\\": 3, \\\"151\\\": 3, \\\"152\\\": 3, \\\"153\\\": 3, \\\"154\\\": 3, \\\"155\\\": 3, \\\"61\\\": 6, \\\"156\\\": 3, \\\"157\\\": 3, \\\"159\\\": 3, \\\"158\\\": 3}\", \"index_word\": \"{\\\"1\\\": \\\"UNK\\\", \\\"2\\\": \\\"what\\\", \\\"3\\\": \\\"is\\\", \\\"4\\\": \\\"define\\\", \\\"5\\\": \\\"a\\\", \\\"6\\\": \\\"how\\\", \\\"7\\\": \\\"describe\\\", \\\"8\\\": \\\"array\\\", \\\"9\\\": \\\"an\\\", \\\"10\\\": \\\"function\\\", \\\"11\\\": \\\"the\\\", \\\"12\\\": \\\"class\\\", \\\"13\\\": \\\"of\\\", \\\"14\\\": \\\"to\\\", \\\"15\\\": \\\"error\\\", \\\"16\\\": \\\"loop\\\", \\\"17\\\": \\\"doe\\\", \\\"18\\\": \\\"in\\\", \\\"19\\\": \\\"string\\\", \\\"20\\\": \\\"operator\\\", \\\"21\\\": \\\"do\\\", \\\"22\\\": \\\"statement\\\", \\\"23\\\": \\\"are\\\", \\\"24\\\": \\\"structure\\\", \\\"25\\\": \\\"file\\\", \\\"26\\\": \\\"data\\\", \\\"27\\\": \\\"work\\\", \\\"28\\\": \\\"for\\\", \\\"29\\\": \\\"while\\\", \\\"30\\\": \\\"c\\\", \\\"31\\\": \\\"by\\\", \\\"32\\\": \\\"size\\\", \\\"33\\\": \\\"overflow\\\", \\\"34\\\": \\\"inheritance\\\", \\\"35\\\": \\\"explain\\\", \\\"36\\\": \\\"we\\\", \\\"37\\\": \\\"character\\\", \\\"38\\\": \\\"and\\\", \\\"39\\\": \\\"if\\\", \\\"40\\\": \\\"parameter\\\", \\\"41\\\": \\\"storage\\\", \\\"42\\\": \\\"type\\\", \\\"43\\\": \\\"meant\\\", \\\"44\\\": \\\"method\\\", \\\"45\\\": \\\"element\\\", \\\"46\\\": \\\"can\\\", \\\"47\\\": \\\"sort\\\", \\\"48\\\": \\\"search\\\", \\\"49\\\": \\\"value\\\", \\\"50\\\": \\\"cstyle\\\", \\\"51\\\": \\\"short\\\", \\\"52\\\": \\\"header\\\", \\\"53\\\": \\\"chart\\\", \\\"54\\\": \\\"comment\\\", \\\"55\\\": \\\"directive\\\", \\\"56\\\": \\\"long\\\", \\\"57\\\": \\\"double\\\", \\\"58\\\": \\\"syntax\\\", \\\"59\\\": \\\"controlled\\\", \\\"60\\\": \\\"modularity\\\", \\\"61\\\": \\\"state\\\", \\\"62\\\": \\\"protected\\\", \\\"63\\\": \\\"member\\\", \\\"64\\\": \\\"selection\\\", \\\"65\\\": \\\"declaration\\\", \\\"66\\\": \\\"offset\\\", \\\"67\\\": \\\"library\\\", \\\"68\\\": \\\"strcat\\\", \\\"69\\\": \\\"logical\\\", \\\"70\\\": \\\"break\\\", \\\"71\\\": \\\"this\\\", \\\"72\\\": \\\"pointer\\\", \\\"73\\\": \\\"compiler\\\", \\\"74\\\": \\\"purpose\\\", \\\"75\\\": \\\"sequence\\\", \\\"76\\\": \\\"conditional\\\", \\\"77\\\": \\\"constant\\\", \\\"78\\\": \\\"sorting\\\", \\\"79\\\": \\\"find\\\", \\\"80\\\": \\\"char\\\", \\\"81\\\": \\\"between\\\", \\\"82\\\": \\\"list\\\", \\\"83\\\": \\\"return\\\", \\\"84\\\": \\\"strcpy\\\", \\\"85\\\": \\\"strcmp\\\", \\\"86\\\": \\\"empty\\\", \\\"87\\\": \\\"or\\\", \\\"88\\\": \\\"not\\\", \\\"89\\\": \\\"circuiting\\\", \\\"90\\\": \\\"why\\\", \\\"91\\\": \\\"used\\\", \\\"92\\\": \\\"expression\\\", \\\"93\\\": \\\"scope\\\", \\\"94\\\": \\\"you\\\", \\\"95\\\": \\\"being\\\", \\\"96\\\": \\\"mean\\\", \\\"97\\\": \\\"polymorphism\\\", \\\"98\\\": \\\"flow\\\", \\\"99\\\": \\\"pseudocode\\\", \\\"100\\\": \\\"one\\\", \\\"101\\\": \\\"algorithm\\\", \\\"102\\\": \\\"difference\\\", \\\"103\\\": \\\"normal\\\", \\\"104\\\": \\\"cstr\\\", \\\"105\\\": \\\"logic\\\", \\\"106\\\": \\\"behind\\\", \\\"107\\\": \\\"true\\\", \\\"108\\\": \\\"truth\\\", \\\"109\\\": \\\"table\\\", \\\"110\\\": \\\"switch\\\", \\\"111\\\": \\\"overloading\\\", \\\"112\\\": \\\"test\\\", \\\"113\\\": \\\"preprocessor\\\", \\\"114\\\": \\\"include\\\", \\\"115\\\": \\\"iostream\\\", \\\"116\\\": \\\"cmath\\\", \\\"117\\\": \\\"namespace\\\", \\\"118\\\": \\\"using\\\", \\\"119\\\": \\\"code\\\", \\\"120\\\": \\\"block\\\", \\\"121\\\": \\\"main\\\", \\\"122\\\": \\\"variable\\\", \\\"123\\\": \\\"memory\\\", \\\"124\\\": \\\"snapshot\\\", \\\"125\\\": \\\"int\\\", \\\"126\\\": \\\"float\\\", \\\"127\\\": \\\"bool\\\", \\\"128\\\": \\\"boolean\\\", \\\"129\\\": \\\"implementation\\\", \\\"130\\\": \\\"truncated\\\", \\\"131\\\": \\\"result\\\", \\\"132\\\": \\\"underflow\\\", \\\"133\\\": \\\"cin\\\", \\\"134\\\": \\\"cout\\\", \\\"135\\\": \\\"parse\\\", \\\"136\\\": \\\"execution\\\", \\\"137\\\": \\\"runtime\\\", \\\"138\\\": \\\"continue\\\", \\\"139\\\": \\\"module\\\", \\\"140\\\": \\\"abstraction\\\", \\\"141\\\": \\\"driver\\\", \\\"142\\\": \\\"prototype\\\", \\\"143\\\": \\\"custom\\\", \\\"144\\\": \\\"actual\\\", \\\"145\\\": \\\"static\\\", \\\"146\\\": \\\"random\\\", \\\"147\\\": \\\"number\\\", \\\"148\\\": \\\"seed\\\", \\\"149\\\": \\\"mutator\\\", \\\"150\\\": \\\"standard\\\", \\\"151\\\": \\\"stream\\\", \\\"152\\\": \\\"multiple\\\", \\\"153\\\": \\\"endoffile\\\", \\\"154\\\": \\\"trailer\\\", \\\"155\\\": \\\"signal\\\", \\\"156\\\": \\\"whitespace\\\", \\\"157\\\": \\\"flag\\\", \\\"158\\\": \\\"summation\\\", \\\"159\\\": \\\"notation\\\", \\\"160\\\": \\\"there\\\", \\\"161\\\": \\\"good\\\", \\\"162\\\": \\\"day\\\", \\\"163\\\": \\\"use\\\", \\\"164\\\": \\\"many\\\", \\\"165\\\": \\\"stored\\\", \\\"166\\\": \\\"top\\\", \\\"167\\\": \\\"down\\\", \\\"168\\\": \\\"design\\\", \\\"169\\\": \\\"flowchart\\\", \\\"170\\\": \\\"programming\\\", \\\"171\\\": \\\"relational\\\", \\\"172\\\": \\\"declare\\\", \\\"173\\\": \\\"sequential\\\", \\\"174\\\": \\\"exceed\\\", \\\"175\\\": \\\"cstring\\\", \\\"176\\\": \\\"strlen\\\", \\\"177\\\": \\\"length\\\", \\\"178\\\": \\\"copy\\\", \\\"179\\\": \\\"another\\\", \\\"180\\\": \\\"compare\\\", \\\"181\\\": \\\"add\\\", \\\"182\\\": \\\"get\\\", \\\"183\\\": \\\"substr\\\", \\\"184\\\": \\\"else\\\", \\\"185\\\": \\\"nested\\\", \\\"186\\\": \\\"controlling\\\", \\\"187\\\": \\\"modification\\\", \\\"188\\\": \\\"command\\\", \\\"189\\\": \\\"counter\\\", \\\"190\\\": \\\"sentinel\\\", \\\"191\\\": \\\"end\\\", \\\"192\\\": \\\"infinite\\\", \\\"193\\\": \\\"advantage\\\", \\\"194\\\": \\\"definition\\\", \\\"195\\\": \\\"body\\\", \\\"196\\\": \\\"formal\\\", \\\"197\\\": \\\"pas\\\", \\\"198\\\": \\\"hi\\\", \\\"199\\\": \\\"anyone\\\", \\\"200\\\": \\\"hello\\\", \\\"201\\\": \\\"whats\\\", \\\"202\\\": \\\"up\\\", \\\"203\\\": \\\"entail\\\", \\\"204\\\": \\\"cya\\\", \\\"205\\\": \\\"see\\\", \\\"206\\\": \\\"later\\\", \\\"207\\\": \\\"goodbye\\\", \\\"208\\\": \\\"i\\\", \\\"209\\\": \\\"am\\\", \\\"210\\\": \\\"leaving\\\", \\\"211\\\": \\\"have\\\", \\\"212\\\": \\\"visual\\\", \\\"213\\\": \\\"studio\\\", \\\"214\\\": \\\"h\\\", \\\"215\\\": \\\"stepwise\\\", \\\"216\\\": \\\"refinement\\\", \\\"217\\\": \\\"repetition\\\", \\\"218\\\": \\\"iteration\\\", \\\"219\\\": \\\"initialize\\\", \\\"220\\\": \\\"me\\\", \\\"221\\\": \\\"dimensional\\\", \\\"222\\\": \\\"made\\\", \\\"223\\\": \\\"maximum\\\", \\\"224\\\": \\\"be\\\", \\\"225\\\": \\\"vector\\\", \\\"226\\\": \\\"ascending\\\", \\\"227\\\": \\\"descending\\\", \\\"228\\\": \\\"binary\\\", \\\"229\\\": \\\"ordered\\\", \\\"230\\\": \\\"faster\\\", \\\"231\\\": \\\"differentiate\\\", \\\"232\\\": \\\"assign\\\", \\\"233\\\": \\\"more\\\", \\\"234\\\": \\\"than\\\", \\\"235\\\": \\\"join\\\", \\\"236\\\": \\\"concatenate\\\", \\\"237\\\": \\\"ascii\\\", \\\"238\\\": \\\"know\\\", \\\"239\\\": \\\"edit\\\", \\\"240\\\": \\\"specific\\\", \\\"241\\\": \\\"part\\\", \\\"242\\\": \\\"filename\\\", \\\"243\\\": \\\"operation\\\", \\\"244\\\": \\\"stand\\\", \\\"245\\\": \\\"alone\\\", \\\"246\\\": \\\"fuction\\\", \\\"247\\\": \\\"inside\\\", \\\"248\\\": \\\"case\\\", \\\"249\\\": \\\"write\\\", \\\"250\\\": \\\"application\\\", \\\"251\\\": \\\"undeflow\\\", \\\"252\\\": \\\"update\\\", \\\"253\\\": \\\"kind\\\", \\\"254\\\": \\\"terminate\\\", \\\"255\\\": \\\"required\\\", \\\"256\\\": \\\"needed\\\", \\\"257\\\": \\\"fine\\\", \\\"258\\\": \\\"automatic\\\", \\\"259\\\": \\\"auto\\\"}\", \"word_index\": \"{\\\"UNK\\\": 1, \\\"what\\\": 2, \\\"is\\\": 3, \\\"define\\\": 4, \\\"a\\\": 5, \\\"how\\\": 6, \\\"describe\\\": 7, \\\"array\\\": 8, \\\"an\\\": 9, \\\"function\\\": 10, \\\"the\\\": 11, \\\"class\\\": 12, \\\"of\\\": 13, \\\"to\\\": 14, \\\"error\\\": 15, \\\"loop\\\": 16, \\\"doe\\\": 17, \\\"in\\\": 18, \\\"string\\\": 19, \\\"operator\\\": 20, \\\"do\\\": 21, \\\"statement\\\": 22, \\\"are\\\": 23, \\\"structure\\\": 24, \\\"file\\\": 25, \\\"data\\\": 26, \\\"work\\\": 27, \\\"for\\\": 28, \\\"while\\\": 29, \\\"c\\\": 30, \\\"by\\\": 31, \\\"size\\\": 32, \\\"overflow\\\": 33, \\\"inheritance\\\": 34, \\\"explain\\\": 35, \\\"we\\\": 36, \\\"character\\\": 37, \\\"and\\\": 38, \\\"if\\\": 39, \\\"parameter\\\": 40, \\\"storage\\\": 41, \\\"type\\\": 42, \\\"meant\\\": 43, \\\"method\\\": 44, \\\"element\\\": 45, \\\"can\\\": 46, \\\"sort\\\": 47, \\\"search\\\": 48, \\\"value\\\": 49, \\\"cstyle\\\": 50, \\\"short\\\": 51, \\\"header\\\": 52, \\\"chart\\\": 53, \\\"comment\\\": 54, \\\"directive\\\": 55, \\\"long\\\": 56, \\\"double\\\": 57, \\\"syntax\\\": 58, \\\"controlled\\\": 59, \\\"modularity\\\": 60, \\\"state\\\": 61, \\\"protected\\\": 62, \\\"member\\\": 63, \\\"selection\\\": 64, \\\"declaration\\\": 65, \\\"offset\\\": 66, \\\"library\\\": 67, \\\"strcat\\\": 68, \\\"logical\\\": 69, \\\"break\\\": 70, \\\"this\\\": 71, \\\"pointer\\\": 72, \\\"compiler\\\": 73, \\\"purpose\\\": 74, \\\"sequence\\\": 75, \\\"conditional\\\": 76, \\\"constant\\\": 77, \\\"sorting\\\": 78, \\\"find\\\": 79, \\\"char\\\": 80, \\\"between\\\": 81, \\\"list\\\": 82, \\\"return\\\": 83, \\\"strcpy\\\": 84, \\\"strcmp\\\": 85, \\\"empty\\\": 86, \\\"or\\\": 87, \\\"not\\\": 88, \\\"circuiting\\\": 89, \\\"why\\\": 90, \\\"used\\\": 91, \\\"expression\\\": 92, \\\"scope\\\": 93, \\\"you\\\": 94, \\\"being\\\": 95, \\\"mean\\\": 96, \\\"polymorphism\\\": 97, \\\"flow\\\": 98, \\\"pseudocode\\\": 99, \\\"one\\\": 100, \\\"algorithm\\\": 101, \\\"difference\\\": 102, \\\"normal\\\": 103, \\\"cstr\\\": 104, \\\"logic\\\": 105, \\\"behind\\\": 106, \\\"true\\\": 107, \\\"truth\\\": 108, \\\"table\\\": 109, \\\"switch\\\": 110, \\\"overloading\\\": 111, \\\"test\\\": 112, \\\"preprocessor\\\": 113, \\\"include\\\": 114, \\\"iostream\\\": 115, \\\"cmath\\\": 116, \\\"namespace\\\": 117, \\\"using\\\": 118, \\\"code\\\": 119, \\\"block\\\": 120, \\\"main\\\": 121, \\\"variable\\\": 122, \\\"memory\\\": 123, \\\"snapshot\\\": 124, \\\"int\\\": 125, \\\"float\\\": 126, \\\"bool\\\": 127, \\\"boolean\\\": 128, \\\"implementation\\\": 129, \\\"truncated\\\": 130, \\\"result\\\": 131, \\\"underflow\\\": 132, \\\"cin\\\": 133, \\\"cout\\\": 134, \\\"parse\\\": 135, \\\"execution\\\": 136, \\\"runtime\\\": 137, \\\"continue\\\": 138, \\\"module\\\": 139, \\\"abstraction\\\": 140, \\\"driver\\\": 141, \\\"prototype\\\": 142, \\\"custom\\\": 143, \\\"actual\\\": 144, \\\"static\\\": 145, \\\"random\\\": 146, \\\"number\\\": 147, \\\"seed\\\": 148, \\\"mutator\\\": 149, \\\"standard\\\": 150, \\\"stream\\\": 151, \\\"multiple\\\": 152, \\\"endoffile\\\": 153, \\\"trailer\\\": 154, \\\"signal\\\": 155, \\\"whitespace\\\": 156, \\\"flag\\\": 157, \\\"summation\\\": 158, \\\"notation\\\": 159, \\\"there\\\": 160, \\\"good\\\": 161, \\\"day\\\": 162, \\\"use\\\": 163, \\\"many\\\": 164, \\\"stored\\\": 165, \\\"top\\\": 166, \\\"down\\\": 167, \\\"design\\\": 168, \\\"flowchart\\\": 169, \\\"programming\\\": 170, \\\"relational\\\": 171, \\\"declare\\\": 172, \\\"sequential\\\": 173, \\\"exceed\\\": 174, \\\"cstring\\\": 175, \\\"strlen\\\": 176, \\\"length\\\": 177, \\\"copy\\\": 178, \\\"another\\\": 179, \\\"compare\\\": 180, \\\"add\\\": 181, \\\"get\\\": 182, \\\"substr\\\": 183, \\\"else\\\": 184, \\\"nested\\\": 185, \\\"controlling\\\": 186, \\\"modification\\\": 187, \\\"command\\\": 188, \\\"counter\\\": 189, \\\"sentinel\\\": 190, \\\"end\\\": 191, \\\"infinite\\\": 192, \\\"advantage\\\": 193, \\\"definition\\\": 194, \\\"body\\\": 195, \\\"formal\\\": 196, \\\"pas\\\": 197, \\\"hi\\\": 198, \\\"anyone\\\": 199, \\\"hello\\\": 200, \\\"whats\\\": 201, \\\"up\\\": 202, \\\"entail\\\": 203, \\\"cya\\\": 204, \\\"see\\\": 205, \\\"later\\\": 206, \\\"goodbye\\\": 207, \\\"i\\\": 208, \\\"am\\\": 209, \\\"leaving\\\": 210, \\\"have\\\": 211, \\\"visual\\\": 212, \\\"studio\\\": 213, \\\"h\\\": 214, \\\"stepwise\\\": 215, \\\"refinement\\\": 216, \\\"repetition\\\": 217, \\\"iteration\\\": 218, \\\"initialize\\\": 219, \\\"me\\\": 220, \\\"dimensional\\\": 221, \\\"made\\\": 222, \\\"maximum\\\": 223, \\\"be\\\": 224, \\\"vector\\\": 225, \\\"ascending\\\": 226, \\\"descending\\\": 227, \\\"binary\\\": 228, \\\"ordered\\\": 229, \\\"faster\\\": 230, \\\"differentiate\\\": 231, \\\"assign\\\": 232, \\\"more\\\": 233, \\\"than\\\": 234, \\\"join\\\": 235, \\\"concatenate\\\": 236, \\\"ascii\\\": 237, \\\"know\\\": 238, \\\"edit\\\": 239, \\\"specific\\\": 240, \\\"part\\\": 241, \\\"filename\\\": 242, \\\"operation\\\": 243, \\\"stand\\\": 244, \\\"alone\\\": 245, \\\"fuction\\\": 246, \\\"inside\\\": 247, \\\"case\\\": 248, \\\"write\\\": 249, \\\"application\\\": 250, \\\"undeflow\\\": 251, \\\"update\\\": 252, \\\"kind\\\": 253, \\\"terminate\\\": 254, \\\"required\\\": 255, \\\"needed\\\": 256, \\\"fine\\\": 257, \\\"automatic\\\": 258, \\\"auto\\\": 259}\"}}"